{
  "ramayana": {
    "hindi": {
      "1": [
        "०१-नवंबर-२०२५ से उपलब्ध"
      ],
      "2": [
        "०१-जनवरी-२०२६ से उपलब्ध"
      ],
      "3": [
        "०१-जनवरी-२०२६ से उपलब्ध"
      ]
    },
    "marathi": {
      "1": [
        "०१-नोव्हेंबर-२०२५ पासून उपलब्ध"
      ],
      "2": [
        "०१-जानेवारी-२०२६ पासून उपलब्ध"
      ],
      "3": [
        "०१-जानेवारी-२०२६ पासून उपलब्ध"
      ]
    },
    "english": {
      "1": [
        "**<u>The First Sarga of Bala Kanda: The Glorious Life of Sri Rama</u>**<p>Saint Valmiki, the venerable ascetic, inquired of Narada, the knower of past, present, and future, seeking to know of a man who embodied all virtues, strength, wisdom, and noble qualities. He asked who was self-restrained, free from envy and anger, devoted to righteousness, and capable of extraordinary deeds, admired by gods and men alike.</p><p>Narada, delighted by the sage’s inquiry, revealed that such a man was Sri Rama, born in the race of King Ikshvaku. Endowed with brilliance, valor, and self-command, Rama was virtuous, eloquent, handsome, and ever intent on the welfare of all beings. His strength, wisdom, and adherence to dharma surpassed that of mortals and gods alike, and he was beloved of all.</p><p>King Dasaratha, desiring to install his eldest son Rama as heir, was compelled by Queen Kaikeyi’s boons to send Rama into exile. Obedient to his father and steadfast in his vows, Rama departed for the forest, accompanied by his devoted brother Lakshmana and his virtuous wife Sita. Together they dwelt in the forest of Chitrakuta, living a life resembling that of celestial beings.</p><p>During their exile, Rama slew numerous demons, including Viradha, Khara, Trisira, and Dushana, protecting sages and maintaining righteousness. The demoness Surpanakha’s instigations led to the abduction of Sita by Ravana, plunging Rama into grief. With courage and wisdom, Rama pursued her, aided by allies such as Sugriva, Hanuman, and other vanaras, establishing alliances and overcoming formidable foes.</p><p>Through mighty deeds and divine guidance, Rama vanquished Ravana, rescued Sita, and restored righteousness. Upon returning to Ayodhya, he ascended the throne, ruling justly and benevolently. Under his reign, people lived free from fear, disease, famine, and sorrow, enjoying prosperity and happiness akin to the age of Krita Yuga. Rama’s rule exemplified dharma, generosity, and valor, pleasing gods and mortals alike.</p><p>The story of Rama, as recounted by Narada to Valmiki, is sacred and holy, destroying sins and imparting virtue. Those who hear, read, or recite it are blessed with longevity, prosperity, and spiritual merit, attaining honor and bliss in this world and the next.</p><p>Thus ends the first sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, narrating the exemplary life and deeds of Sri Rama from birth to his victorious return to Ayodhya.</p>",
        "**<u>The Second Sarga of Bala Kanda: The Inspiration for Composing the Ramayana</u>**<p>In the quietude of the morning, sage Valmiki approached the sacred bank of the river Tamasa for his ablutions. There, he witnessed a tragic scene: a hunter cruelly struck down a male krauncha bird, leaving its female companion wailing in grief. Moved by compassion, Valmiki reflected upon the sorrow of the bereaved bird and, inspired by his deep empathy, spontaneously composed a sloka in perfect metre, expressing the injustice of the act.</p>  <p>At that moment, the effulgent Lord Brahma, desiring to see the sage, appeared before him. Overcome with reverence and awe, Valmiki worshipped the creator with offerings, respectful gestures, and inquiry about his welfare. Pleased, Brahma seated Valmiki before him and, observing the sloka born of compassion, assured the sage that it was indeed a proper composition. Thereafter, Brahma commanded Valmiki to compose the entire history of Rama, as narrated by Narada, in the same metre, declaring that it should be truthful, delightful, and eternal, to endure as long as the mountains, rivers, and Earth exist.</p> <p>Receiving divine sanction, Valmiki, absorbed in thought, returned to his hermitage, meditating upon the sacred task. With his disciples at his side, he began composing the Ramayana, arranging the story in harmonious verses, melodious compounds, and meaningful phrases. This kavya, celebrating Rama’s virtues and recounting the destruction of the ten-headed Ravana, was thus set to endure through the ages, inspiring generations to come.</p>  <p>Thus ends the second sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the compassionate inspiration that led to the creation of this eternal epic.</p>",
        "**<u>The Third Sarga of Bala Kanda: Sage Valmiki Visualizes the Life of Rama</u>**<p>Having heard the entire story of Rama from the illustrious sage Narada, the righteous Valmiki, endowed with wisdom, sought to know the past events of Rama’s life more clearly. Performing achamana and sitting on kusha grass with folded palms, he used the power of his penance to discern the course of all occurrences relating to Rama, Lakshmana, Sita, King Dasaratha, his queens, and the kingdom, observing their conversations, laughter, and deeds exactly as they happened in real life.</p>  <p>He visualized all that Rama, truthful and virtuous, acquired and experienced in the Dandakaranya forest with Sita as his companion, as if holding the entire past in his palm. With this clarity, the highly resplendent sage, blending worldly merits with the detailed description of righteousness, prepared to compose the story of delightful Rama which captivates the mind and ears of all.</p>  <p>Valmiki faithfully recounted the history as narrated by Narada, describing Rama’s birth, his great prowess, benevolence, handsomeness, forbearance, and truthfulness. He narrated Rama’s association with Viswamitra, wondrous adventures, the breaking of the great bow, his marriage with Janaki, the altercation with Parasurama, his coronation, Kaikeyi’s wickedness, obstacles to his coronation, his departure to the forest, and the grief of King Dasaratha and the people of Ayodhya.</p>  <p>He further described Rama’s journey and experiences in the forest: meeting sages like Bharadwaja, Sarabhanga, and Agastya, encounters with Jatayu, Kabandha, Sabari, and Hanuman, crossing rivers and mountains, the killing of Viradha, Maricha, Khara, and Trisiras, the abduction of Sita by Ravana, Hanuman’s adventures in Lanka, the burning of Lanka, and the eventual reunion with Sita. He recounted the deaths of Kumbhakarna and Meghanada, Vibhishana’s coronation, Rama’s return to Ayodhya, his coronation, and the disbanding of the forces, as well as Sita’s banishment.</p>  <p>Finally, the divine sage composed, in the Uttarakanda, all events yet to occur on Earth in the life of Rama, ensuring the continuity of the epic narrative for generations to come.</p>  <p>Thus ends the third sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the divine sage’s visualization of Rama’s life and preparation to narrate the epic in its entirety.</p>",
		    "**<u>The Fourth Sarga of Bala Kanda: Kusa and Lava, the Young Singers of the Ramayana</u>**<p>The divine sage Valmiki, having composed the entire lifestory of Rama who regained his kingdom in twenty-four thousand verses across six kandas and the Uttarakanda, reflected upon who could recite his epic suitably for performance. While he pondered, two young princes, Kusa and Lava, clad in ascetic garb, approached the sage and bowed at his feet. The sage observed that both brothers were well-versed in dharma, possessed intellect, and had melodious voices, and he initiated them into the Ramayana for recitation and song.</p><p>Valmiki had composed this great epic, recounting the life of Sita and the slaying of Paulastya (Ravana), in such a way that it could be sung with charm and memorably recited. The twin brothers, resembling gandharvas in human form and reflecting the beauty of Rama himself, committed the entire epic to memory and sang it in assemblies of sages, brahmins, and saints. Their performance was melodious, expressive, and tuneful, capable of conveying the various moods—amorous, compassionate, humorous, heroic, fearful, and even violent.</p><p>On one occasion, Kusa and Lava sang the Ramayana in the presence of assembled sages. Overcome with joy and tears, the sages praised the twins, exclaiming 'Excellent, excellent!' The brothers sang in perfect unison, their voices rich with musical notes and imbued with emotion, delighting all who listened. Even the young princes’ chanting in the streets and on principal roads spread pleasure, longevity, and prosperity to all who heard it.</p>  <p>Soon, Rama, the destroyer of enemies, observed the twin singers and invited them to his palace. Seated on the splendid golden throne with his ministers and brothers around him, Rama, upon seeing Kusa and Lava, urged them to commence their recital. With melodious voices and ample musical skill, the twins chanted the Ramayana in a distinctly meaningful way, captivating the hearts, minds, and senses of the listeners.</p>  <p>Thus ends the fourth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the introduction of Kusa and Lava as the melodious and disciplined young singers of the epic, whose recitation brought joy and enlightenment to all around them.</p>",
		    "**<u>The Fifth Sarga of Bala Kanda: Dasaratha’s Kingdom and the Greatness of Ayodhya</u>**<p>Formerly, the entire earth was ruled by victorious kings descending from Prajapati (Manu). Among them, King Sagara, who had sixty thousand sons, once got the ocean dug and was always surrounded by his mighty warriors. From the lineage of these Ikshvaku kings arose the celebrated epic, the Ramayanam.</p>  <p>This Ramayanam, encompassing the merits of dharma, artha, and kama, is to be propagated from the very beginning for all to hear without prejudice. In this era, the prosperous country of Kosala, abundant in wealth and grains, lay on the banks of the river Sarayu. Its capital, the famed city of Ayodhya, was personally built by Manu, the lord of men.</p>  <p>Ayodhya was a magnificent city, extending twelve yojanas in length and three yojanas in breadth. Its broad highways were strewn with blossoms and sprinkled with water, adorned with arched gateways, bustling markets, palaces, and all kinds of artisans. The city abounded in eulogists, genealogists, musicians, and performers. Surrounded by gardens, mangroves, and a rampart of sal trees, it was further protected by deep fortifications and a moat, and filled with elephants, horses, cattle, camels, and mules. Tributary kings and merchants from distant lands embellished it even more.</p>  <p>Ayodhya’s seven-storied palaces, resplendent with precious gems, were inhabited by the noblest of men. The city echoed with trumpets, mridangas, vinas, and panavas. Skilled warriors, the maharathas, protected the city; they could slay roaring lions, tigers, and boars in the forest with their sharp arrows or immense strength. King Dasaratha resided there, ensuring the prosperity and grandeur of his kingdom.</p>  <p>The city was further filled with learned and virtuous dwijas—brahmins, kshatriyas, and vaishyas—versed in Vedas and Vedangas, devoted to truth, generous, and dignified. These sages and scholars performed sacrificial rituals, adding to the sacred and auspicious atmosphere of Ayodhya.</p>  <p>Thus ends the fifth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i>, recounting the glory, prosperity, and greatness of Ayodhya and its ruler, King Dasaratha.</p> ",
		    "**<u>The Sixth Sarga of Bala Kanda: Riches, Comforts, and Virtues of Dasaratha’s Subjects</u>**<p>In the city of Ayodhya, King Dasaratha, a descendant of Ikshvaku, ruled the entire world following the example of Manu, the great protector of people. Dasaratha was well-versed in the Vedas, farsighted, mighty, devoted to dharma, and dear to his subjects. He was a great charioteer, capable of fighting many maharathas alone, performed sacrifices, controlled his senses perfectly, and was comparable in wealth to Indra and Kubera. Bound by truth and righteousness, he governed Ayodhya like Indra ruled Amaravati.</p>  <p>The people of Ayodhya were virtuous, happy, well-learned, content with their own possessions, free from greed, truthful, righteous, and self-controlled. Every householder had adequate wealth, food, cattle, and horses. There was no lustful, cruel, miserly, atheistic, unscholarly, or impure person. Everyone performed sacrifices and religious vows, and the brahmins were studious, charitable, and disciplined.</p>  <p>Men and women were endowed with wealth and beauty, devoted to the king, righteous, courageous, munificent, long-lived, and living together with their families. The castes—brahmins, kshatriyas, vaisyas, and sudras—were dutiful, obedient, and occupied in their proper professions. The city was ably governed by Dasaratha in the same wise manner as Manu had administered it.</p>  <p>Ayodhya was teeming with warriors, strong and expert in arms, resembling lions and flaming fire. The city abounded with excellent horses from regions like Kambhoja, Bahlika, Vanayu, and Sindhu, and elephants of great strength, born in Vindhya and Himalaya, including the noble breeds of Airavata, Mahapadma, Anjana, and Vamana. The city was always full of elephants like mountains, belonging to various prestigious lineages.</p>  <p>Ayodhya, spread over a distance of sixteen miles, was truly worthy of its name. The city had strong gates, solid locks, and beautiful edifices, teeming with thousands of inhabitants. King Dasaratha, mighty and brilliant, vanquished foes like the Moon ruling over the stars and governed Ayodhya like Indra over Amaravati. The city was auspicious, invincible, and adorned with prosperity and grandeur.</p>  <p>Thus ends the sixth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i>, describing the wealth, comforts, virtues, and prosperity of Ayodhya and its citizens under the reign of King Dasaratha.</p> ",
		    "**<u>The Seventh Sarga of Bala Kanda: King Dasaratha’s Court and Virtues of Ministers</u>**<p>King Dasaratha, the great scion of Ikshvaku, was attended by ministers endowed with all virtues. They were competent counsellors, skilled in discerning motives from facial features, and always intent on doing what was dear and beneficial to the king. There were eight illustrious ministers—Dhrishti, Jayanta, Vijaya, Siddhartha, Arthasadhaka, Ashoka, Mantrapala, and Sumantra—ever devoted to royal duties and free from blemish in conduct. Two excellent rishis, Vasishta and Vamadeva, served as family priests alongside other advisers.</p>  <p>The ministers were well-educated, proficient, magnanimous, wealthy, and steadfast in prowess. They restrained their senses, acted in accordance with their words, were forgiving, renowned, and always spoke with a smile. They never uttered untruth or injustice, whether in anger, for desire, or for pecuniary gains, and were fully aware of all actions—past, present, and intended—through their network of spies. They were competent in dealings, true to friends, and even imposed appropriate punishment on their own sons when needed. Experts in replenishing the treasury and managing the army, they never harmed anyone unjustly.</p>  <p>The ministers were heroic, steadfast, and always protected virtuous people while following state policy. They ensured brahmins and kshatriyas were unharmed and administered the kingdom with fairness and diligence. There were no liars, wicked men, or those enamoured with others’ wives. Serenity and righteousness prevailed throughout the kingdom, including the city of excellence. Ministers were well-dressed, possessed good character, vigilant, and guided by intellect in all affairs. They were experts in peace and war, proficient in secrecy, well-versed in ethics, and always spoke pleasing words.</p>  <p>Surrounded by such virtuous and competent ministers, the faultless King Dasaratha ruled the earth. He protected his people through spies, kept them happy, and punished the unrighteous. He was munificent and upheld truth, renowned across the three worlds, a tiger among men. His friends were many, and all tributary kings were obedient. He defeated his enemies with might and faced no foe superior or equal to him. With these devoted ministers guiding him, he acquired glory like the rising Sun, shining luminously over the world.</p>  <p>Thus ends the seventh sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i>, describing the virtuous ministers and the wise, just rule of King Dasaratha.</p>",
		    "**<u>The Eight Sarga of Bala Kanda : King Dasaratha’s Desire for Heirs and the Ashwamedha Sacrifice</u>** : <p>King Dasaratha, despite his greatness, had no sons to continue the Ikshvaku lineage, which caused him deep sorrow as he aged. Resolving to obtain heirs, he decided to perform the Ashwamedha (horse) sacrifice to invoke divine blessings.</p><p>He summoned his ministers, sages, and family priests, including Vasishta, Suyajna, Vamadeva, Jabali, and Kasyapa, to seek their guidance and approval. Expressing his desire, Dasaratha emphasized that having no sons was a source of deep suffering, and asked for their advice on performing the sacrifice properly.</p><p>The brahmins and priests praised the king’s decision, assuring him that it was righteous and would indeed fulfill his desire for sons. They instructed that all necessary articles for the sacrifice be collected and the sacrificial horse be released under proper supervision. They also emphasized that the ritual must follow the sacred ordinances carefully, as any flaw could nullify the sacrifice.</p><p>Dasaratha then instructed his ministers to ensure that the sacrifice was conducted flawlessly according to the scriptures. After sending away the knowledgeable brahmins, he addressed his wives, urging them to begin their own religious disciplines in preparation for the sacred rites.</p><p>The announcement of the sacrifice brought joy to his wives, whose faces shone like blooming lotuses, signifying the auspiciousness of the event.</p><p>Thus ends the eighth sarga of Balakanda, highlighting Dasaratha’s devotion, adherence to dharma, and his efforts to secure heirs through the Ashwamedha sacrifice...</p>",
		    "**<u>The Ninth Sarga of Bala Kanda: King Dasaratha Informed of Sage R̥ṣyaśṛṅga’s Role in Begetting Sons</u>** : <p>King Dasaratha was privately advised by his minister Sumantra, who recalled an ancient prophecy by the sage Sanatkumara. The prophecy said that Dasaratha would gain sons through the help of sage R̥ṣyaśṛṅga, the son of Vibhaṇḍaka rishi.</p><p>R̥ṣyaśṛṅga had been raised in the forest by his father, knowing nothing of the outside world, and was devoted to a strict life of celibacy and worship.</p><p>Meanwhile, in the kingdom of Anga, ruled by King Romapada, a terrible drought struck because the king had failed in his duties. Seeking a solution, the learned brahmins of Anga told Romapada that only by bringing R̥ṣyaśṛṅga to his land could the drought be ended.</p><p>Fearing the power of Vibhaṇḍaka, the king’s men hesitated, but eventually, by clever means involving courtesans, they succeeded in bringing R̥ṣyaśṛṅga to Anga. As soon as he arrived, rains poured down, ending the famine.</p><p>In gratitude, Romapada gave his daughter Śāntā in marriage to the sage R̥ṣyaśṛṅga.</p><p>Sumantra concluded by telling Dasaratha that this very R̥ṣyaśṛṅga, now Romapada’s son-in-law, would be the one to perform the sacrifice that would grant Dasaratha sons.</p><p>Pleased by this account, Dasaratha asked Sumantra to explain in detail how exactly R̥ṣyaśṛṅga had been brought from his hermitage.</p><p>Thus ends the ninth sarga of Balakanda..</p>",
		    "**<u>The Tenth Sarga of Bala Kanda: How Sage R̥ṣyaśṛṅga Was Brought to the Kingdom of Anga and the Famine Ended</u>** : <p>At King Daśaratha’s request, Sumantra began to narrate how R̥ṣyaśṛṅga was brought to the kingdom of Anga.</p><p>The ministers of King Romapāda had devised a plan. They said:“R̥ṣyaśṛṅga, son of the sage Vibhaṇḍaka, lives in the forest, absorbed in penance and Vedic study. He has never seen a woman nor known worldly pleasures. If we send beautifully adorned courtesans, they can gently win his heart and bring him here.”</p><p>Romapāda agreed, and the plan was set in motion.</p><p>The courtesans entered the forest and waited near the hermitage. One day, the young ascetic R̥ṣyaśṛṅga, who had never seen any living being outside the forest, came upon them. The women sang sweetly, smiled, and asked him who he was.</p><p>Innocently, R̥ṣyaśṛṅga introduced himself:“I am the son of sage Vibhaṇḍaka. My name is R̥ṣyaśṛṅga. Please come to our hermitage; I will offer you fruits and roots.”</p><p>The women went with him, accepted his offerings, but quickly departed in fear of Vibhaṇḍaka’s return. Before leaving, they embraced him and gave him sweets and delicacies, which he mistook for forest fruits.</p><p>When they left, R̥ṣyaśṛṅga felt restless and sorrowful. The next day, drawn by longing, he went in search of them. The courtesans welcomed him again and said:“Handsome one, come to our hermitage. We will give you greater hospitality.”</p><p>Overjoyed, R̥ṣyaśṛṅga agreed. The women gently led him away — and as soon as he set foot in Anga, the heavens poured rain, ending the long famine.</p><p>King Romapāda himself came out to receive the sage. Bowing low, he worshipped him with great devotion and prayed that Vibhaṇḍaka would not be angered at this act.</p><p>Then, to honor him, Romapāda offered his daughter Śāntā in marriage to R̥ṣyaśṛṅga. The sage accepted, and thus he lived happily in Anga, bringing peace and prosperity to the kingdom.</p><p>Thus ends the tenth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the bringing of R̥ṣyaśṛṅga to Anga and the end of the kingdom’s famine.</p>",
		    "**<u>The Eleventh Sarga of Bala Kanda: King Dasaratha Meets Sage R̥ṣyaśṛṅga and Brings Him to Ayodhya for the Sacrifice</u>** : <p>Hearing Sanatkumara’s prophecy, Sumantra advised King Dasaratha to approach King Romapada of Anga. Romapada’s daughter Shanta was married to the sage Rsyasringa, a holy brahmin of great spiritual power who alone could help Dasaratha gain sons.</p><p>Eager and hopeful, Dasaratha set out with his queens and ministers to meet Romapada. Crossing forests and rivers, he finally reached the kingdom of Anga, where Romapada warmly welcomed him with friendship and honor. There, Dasaratha also met the gentle Shanta and her radiant husband, Rsyasringa.</p><p>After days of hospitality, Dasaratha spoke of his deep desire for children and respectfully requested that Rsyasringa accompany him to Ayodhya to perform a great sacrifice. Romapada gladly agreed, and with his blessing, Rsyasringa and Shanta prepared to leave.</p><p>As they journeyed back, messengers hurried ahead, announcing the king’s return. The citizens of Ayodhya joyfully decorated the city with flags, flowers, and water-sprinkled streets. Amidst the sound of drums and conches, Dasaratha entered the city, Rsyasringa and Shanta by his side.</p><p>The people rejoiced to see the holy sage, honored by the king like Indra himself. Dasaratha, filled with relief and happiness, welcomed Rsyasringa into the palace, knowing his wish was close to fulfillment. Shanta too was lovingly received by the royal women, who delighted in her presence.</p><p>Thus ended the eleventh sarga of Bala Kanda, where destiny began to unfold for the birth of Rama and his brothers.</p>",
		    "**<u>The Twelfth Sarga of Bala Kanda: King Dasaratha Prepares for the Ashwamedha Sacrifice and His Desire for a Son</u>** : <p>Spring arrived and in the freshness of the season King Dasaratha felt once more the deep longing for a son. The idea of performing the great horse sacrifice (Ashwamedha Yajña) stirred in his heart.</p> <p>He resolved that a priest worthy and shining like a celestial should be appointed to preside over the sacrifice so that his dynasty would continue unbroken. The king told his minister Sumantra to gather all sacred materials and to release the sacrificial horse — the sign that the rite was to begin.</p> <p>Sumantra at once summoned the wisest brahmins: Suyajna, Vamadeva, Jabali, Kashyapa, Vasiṣṭha, and others well versed in the Vedas. The king greeted them with respect, bowed to them, and spoke with words full of duty and righteousness.</p> <p>With folded hands, he confessed his sorrow: having no son, there was no true happiness for him. Yet he would follow scriptural rites, and through the grace of the sage R̥ṣyaśṛṅga, his desires would be fulfilled.</p> <p>The brahmins, led by Vasiṣṭha, heard him, blessed his intention, and spoke with certainty that he would indeed have four heroic sons. The king, overjoyed, gave orders that all needed materials be brought together, that the horse be released under protection, and that a sacrificial pavilion (yajña-bhūmi) be built on the northern bank of the river Sarayu.</p> <p>He commanded everything be done in perfect accord with the sacred texts, without flaw. He warned against any error, since celestial beings (brahma-rākṣasas) are ever watchful and will destroy any sacrifice marred by mistake.</p> <p>The ministers, faithful and capable, carried out his orders. The brahmins were honored and then permitted to return. King Dasaratha dismissed his ministers and entered his palace, satisfied that the first steps toward his desire had been sanctified.</p> <p>Thus ends the twelfth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting King Dasaratha’s preparations for the great Ashwamedha sacrifice and his longing for a son.</p>",
		    "**<u>The Thirteenth Sarga of Bala Kanda: King Dasaratha Begins the Ashwamedha Sacrifice with Full Preparations</u>** : <p>When spring came again and a full year had passed, King Dasaratha, filled with hope for sons, entered the sacrificial arena to begin worshipping the gods. He sought to perform the horse sacrifice (Ashwamedha) properly and without any obstruction.</p> <p>With respect and humility, the king greeted Sage Vasiṣṭha, his honored spiritual guide, and asked him to ensure that the sacrifice is carried out in perfect accordance with tradition and free from any flaw. He asked Vasiṣṭha to bear the burden of overseeing the ritual.</p> <p>Vasiṣṭha, kind and devoted, promised to fulfill every requirement. He summoned experienced brahmins, skilled artisans, workers, dancers, actors, carpenters, architects, and all those needed to prepare for the grand sacrifice. He ordered that residences, food, and hospitality be prepared for guests from all lands, including people of all castes.</p> <p>All the arrangements were made: food and drinks, richly decorated dwellings, and honorable treatment for guests, both from nearby regions and far-off countries. Care was taken that nothing small or insignificant was overlooked, and everything was managed with love and affection.</p> <p>Kings from many places heard of the king’s sacrifice and came bearing gifts. Vasiṣṭha, pleased with the preparations, told King Dasaratha that everyone was prepared, and that the auspicious moment had arrived. On a day blessed by favorable stars, Dasaratha, along with Rsyasringa and the foremost brahmins, entered the sacred sacrificial enclosure. The sacrifice began, following the scriptures in every detail.</p> <p>Thus ended the thirteenth sarga of Bala Kanda, where preparations for the Ashwamedha sacrifice were completed with perfection, setting the stage for the divine birth of Rama.</p>",
		    "**<u>The Fourteenth Sarga of Bala Kanda: King Daśaratha Performs the Ashwamedha Sacrifice Under Sage R̥ṣyaśṛṅga</u>** : <p>After a full year, the sacrificial horse returned, and King Daśaratha held the grand **Aśvamedha yajña** on the northern bank of the river Sarayu. The rituals began under the guidance of the great sage R̥ṣyaśṛṅga, the foremost of brahmins, who performed the rites with deep devotion and adherence to the sacred scriptures.</p> <p>The learned priests, masters of Vedas, carried out every ceremony—morning ablutions, offerings, pressing of soma, daily prayers—exactly as the scriptures prescribed. There were no mistakes, no defect, no delay; all the rituals proceeded seamlessly.</p> <p>People from many lands—brahmins, ascetics, the aged, the sick, women, and children—were well provided for. Food, garments, shelter, generosity—all were abundant. Devotees and guests, arriving from far and wide, were honored and served with joy.</p> <p>Sacrificial posts were erected with care, beautiful decorations placed, fires built with precision, and deities worshipped. The sacrificial altar was shaped like Garuda, posts wrapped in fine cloth and adorned with flowers and sandal paste. The implements and instruments were set with artistry, and everything shone in its glory.</p> <p>King Daśaratha gave charity generously—cows, gold, silver, food—to brahmins and needy alike. He honored them, bowed to them, and listened to their blessings. The great sacrifice removed his sins, earned him heaven’s favor, and would ensure many sons to carry on his royal line.</p> <p>Thus ended the fourteenth sarga of Bala Kanda, where Daśaratha’s sacrifice was fulfilled with perfection, blessing him with promise of four sons to uphold his lineage.</p>",
		    "**<u>The Fifteenth Sarga of Bala Kanda: The Gods Petition Brahmā, and the Divine Plan for Viṣṇu’s Incarnation and Daśaratha’s Role Is Revealed</u>** : <p>In the celestial assembly, the gods voiced concern to Brahmā over the terrible deeds of **Rāvana**, empowered by boons and frightening both gods and mortals. They spoke of how righteous beings suffer under his tyranny, and asked Brahmā to find a plan to curb his cruelty.</p> <p>Brahmā listened to the pleas of devas, gandharvas, sages and acknowledged that while Ravana’s boons must be respected, his evil conduct could no longer go unchecked. The gods expressed the need for a divine strategy to defeat Ravana.</p> <p>Moved by their distress, Brahmā then revealed that **Viṣṇu** would incarnate on earth as a human king—one who would take up arms to protect righteousness, destroy Ravana, and relieve the cosmos of fear and injustice. The gods rejoiced at this promise of deliverance.</p> <p>They then turned their minds towards **King Daśaratha**, the human ruler who would be part of this incarnation-plan. It was declared that the sacrifice and the birth of sons in Daśaratha’s lineage would be a link in the divine scheme to bring Viṣṇu’s avatar into the world.</p> <p>Thus ended the fifteenth sarga of Bala Kanda, where the gods’ plea for justice leads Brahmā to reveal the divine plan of Viṣṇu’s incarnation and Daśaratha’s role in cosmic destiny.</p>",
		    "**<u>The Sixteenth Sarga of Bala Kanda: The Putrakāmeṣṭi Sacrifice, Divine Dessert Bestowed, and the Promise of Sons for Daśaratha</u>** : <p>The gods, alarmed at the growing power and tyranny of Ravana, came together to seek a plan to restore justice. They appealed to Lord Vishnu, asking that he take human birth to defeat Ravana and lift the suffering of the worlds. Vishnu agreed, knowing all things yet speaking gently to the assembly.</p> <p>Meanwhile, King Daśaratha, who had no sons, was performing the sacred ritual called **Putrakāmeṣṭi** hoping to beget children. At the gods’ bidding, a divine being—Yajña Purusha—emerged from the sacrificial fire, holding a golden vessel filled with divine sweet dessert, meant to bestow progeny upon the king’s queens.</p> <p>King Daśaratha, overjoyed, distributed the divine dessert among his queens—Kausalyā, Sumitrā, and Kaikeyī—according to divine ordinance. Each queen received a portion, enabling them to conceive. Thus the promise that Daśaratha’s lineage would continue was fulfilled through God’s blessing.</p> <p>The Sacrifice was perfect, the gods were pleased, and hope was born in Ayodhya. The divine intervention ensured that the future heroes—Rama, Lakshmana, Bharata, and Shatrughna—would come into being.</p> <p>Thus ended the sixteenth sarga of Bala Kanda, where the gods’ plan and Daśaratha’s sacrifice combined to bring the divine promise of sons—destiny set in motion for the birth of Rama and his brothers.</p>",
		    "**<u>The Seventeenth Sarga of Bala Kanda: The Birth of the Vanara Race, Mighty Allies for Rama in Upholding Dharma</u>** : <p>As Dasaratha’s sonhood was secured and hope was reborn in Ayodhya, Brahma summoned all the gods. He asked them to create a race of Vanaras—like monkeys—with special powers so they could assist Rama in his future battle against Ravana. These Vanaras would be swift, strong, endowed with intellect, brave, and capable of aiding the righteous.</p> <p>So powerful beings—progeny from celestial beings like Apsaras, Gandharvas, and those of other divine lineages—were born. They were to serve as Rama’s allies, protectors of dharma, ever ready to fight against evil, fearless and loyal.</p> <p>Thus the gods laid down the foundation for the mighty Vanara race whose deeds would shine in Rama’s future struggles.</p> <p>Thus ended the seventeenth sarga of Bala Kanda, where the promise of vanara allies was born to uphold righteousness in Rama’s journey.</p>",
		    "**<u>The Eighteenth Sarga of Bala Kanda: The Auspicious Birth of Rama, Bharata, Lakshmana, and Shatrughna</u>** : <p>After the long wait following the Putrakāmeṣṭi sacrifice, twelve auspicious months had passed. At the dawn of Chaitra on the ninth day — under the Punarvasu asterism, when all the planets were favorably placed — Queen Kausalyā gave birth to Rama. His appearance was divine, adorned with all virtuous signs, and celebrated by all. </p> <p>The next day, Bharata was born under the Pushyami star, followed by the twins Lakshmana and Shatrughna — born to Queen Sumitrā — each with their own special qualities, yet together forming a perfect brotherhood. </p> <p>Dasaratha, filled with joy and gratitude, saw in their growth the fulfillment of his heartfelt hopes. The city celebrated; the sages praised; and the people rejoiced at the arrival of heirs who were seen as worthy of the Ikshvaku lineage. </p> <p>Thus ended the eighteenth sarga of Bala Kanda, where Rama, Bharata, Lakshmana, and Shatrughna were born under auspicious skies, fulfilling the promise of lineage and divine blessing.</p>",
        "**<u>The Nineteenth Sarga of Bala Kanda: Viśvāmitra’s Request and Daśaratha’s Dilemma</u>** <p>The great sage Viśvāmitra, radiant and resolute, spoke to King Daśaratha with reverence and purpose. Having heard the noble words of the king, Viśvāmitra praised him for his truthfulness and lineage, then revealed the cause of his visit. The sage explained that during his sacred sacrifice, two mighty rākṣasas—Mārīca and Subāhu—were defiling the holy altar by raining blood and flesh, disturbing the sanctity of his vows.</p>  <p>Bound by the discipline of his sacred rite, Viśvāmitra could not yield to anger or curse the demons. Instead, he sought a righteous solution. Turning to the king, he requested that his eldest son, Rāma—young, valiant, and steadfast—accompany him to guard the sacrifice. Under the sage’s protection and strengthened by his own divine might, Rāma would surely destroy those wicked beings and uphold dharma. Viśvāmitra promised to bless the prince with celestial powers and enduring fame across the three worlds.</p>  <p>The sage urged Daśaratha not to waver out of paternal affection, assuring him that Rāma alone was destined to vanquish the demons. Granting the boy for ten nights, he said, would bring righteousness, glory, and prosperity to the king’s lineage. With words filled with wisdom and righteousness, Viśvāmitra fell silent, awaiting the king’s decision.</p>  <p>But Daśaratha, hearing the sage’s plea, was overcome with sorrow. Fear gripped his heart at the thought of parting with his beloved son. The mighty king, who had faced many foes without trembling, now felt his strength falter and his spirit sink beneath the weight of love and duty.</p>  <p>Thus ended the nineteenth sarga of Bala Kanda, where the noble sage’s divine mission met the father’s tender grief—the beginning of a destiny that would soon unfold in the journey of Rama.</p>",
        "**<u>The Twentieth Sarga of Bala Kanda: Daśaratha’s Reluctance and Viśvāmitra’s Resolve</u>** <p>When the sage Viśvāmitra finished speaking, King Daśaratha, overcome with fear and love for his son, lost his composure for a moment. Regaining his senses, he spoke with trembling voice and a heart filled with concern. “O revered sage,” he said, “my lotus-eyed son Rāma is not yet sixteen years old. How can such a tender boy fight the fierce rākṣasas who disturb your sacrifice?”</p>  <p>The king offered instead his own strength and army. “I shall come with my mighty *akṣauhiṇī* of warriors,” he declared. “Armed with bows and weapons, my soldiers are valiant and skilled in battle. I myself will guard your sacrifice and ensure its success. It is not right to take Rāma with you—he is still a child, untrained in the arts of war and unaware of the guile of demons.”</p>  <p>Daśaratha’s voice trembled as fatherly affection overcame him. “Separated from Rāma, I cannot live even for a moment. If you must go, take me and my army, but not my son. For sixty thousand years I lived without a child, and only by great sacrifice did I beget him. My love for Rāma surpasses all else; how can I bear to send him away?”</p>  <p>With anxious heart, the king asked, “O noble sage, tell me—who are these rākṣasas? How powerful are they? Whose sons are they, and who protects them? How can mere men resist such beings proud of their might?” Viśvāmitra then revealed that the source of the disturbance was Rāvaṇa, the mighty king of the rākṣasas, brother of Kubera and son of the sage Viśrava. Yet, he said, it was not Rāvaṇa himself but the two demons Mārīca and Subāhu—urged on by him—who defiled the sacrifice.</p>  <p>Hearing this, Daśaratha’s heart sank further. “O holy one,” he pleaded, “no man, god, or demon can stand against Rāvaṇa in battle. Even the mightiest warriors lose their strength before him. How then can my young Rāma face such enemies? I beg of you, protect both me and my son. I cannot part with him under any condition.”</p>  <p>The sage listened in silence, his patience wearing thin. As Daśaratha continued to resist, Viśvāmitra’s divine radiance flared like fire fed with ghee. His eyes blazed with righteous anger—like a sacrificial flame disturbed by mortal hesitation. The air around him seemed to tremble as the great sage, resplendent and wrathful, prepared to speak again.</p>  <p>Thus ended the twentieth sarga of Bala Kanda, where a father’s love clashed with a sage’s divine purpose, and the first spark of destiny began to burn brighter in the tale of Rāma.</p>",
        "**<u>The Twenty-First Sarga of Bala Kanda: Vasiṣṭha’s Counsel Calms Daśaratha and Rāma Prepares to Accompany Viśvāmitra</u>** <p>King Daśaratha’s words, though spoken with love for his son, were filled with hesitation and contradiction. When sage Viśvāmitra heard them, his calm gave way to righteous anger. His eyes blazed as he addressed the king sternly: “O scion of the Raghu line, you gave your word and now seek to break it. Such faithlessness does not befit the noble race of Ikṣvāku! If this is your wish, I shall return from where I came. Remain here, false to your promise, and live happily with your kin.”</p>  <p>The sage’s wrath shook the very earth. The heavens trembled, and fear gripped the hearts of the gods, for Viśvāmitra’s anger was like a blazing fire fed with sacred ghee. Seeing the world itself tremble, the venerable sage Vasiṣṭha, calm and steadfast, rose to speak. “O King,” he said gently, “born in the sacred line of Ikṣvāku, you are the very image of Dharma itself. You are known throughout the three worlds as righteous and firm in vow. Do not abandon your word, for to break a promise destroys the fruits of all your sacrifices and pious deeds.”</p>  <p>Vasiṣṭha continued, “Fear not for Rāma. Whether trained or untrained in weapons, he shall be safe under Viśvāmitra’s protection, just as nectar is guarded by the flames of Agni. The sage is no ordinary man—he is the embodiment of righteousness, unsurpassed in power, wisdom, and ascetic might. None among gods, sages, or demons can rival his mastery of divine weapons. He is capable of both wielding and creating astras unknown to the three worlds. Long ago, the sons of Bṛśāśva—grandsons of Prajāpati—bestowed upon him the most radiant and victorious celestial weapons. Their mothers, the daughters of Dakṣa, Jaya and Suprabhā, gave birth to a hundred such astras, blazing with divine light.”</p>  <p>“O King,” Vasiṣṭha concluded, “Viśvāmitra’s strength is immeasurable. He could destroy the demons himself, yet he seeks Rāma’s company only for the prince’s own good. Do not doubt his purpose. Sending your son with him will bring glory to your house and fulfill the divine plan.”</p>  <p>Hearing these words of wisdom from the great sage, Daśaratha’s heart calmed. His sorrow lifted, and his body shone once more with peace and radiance. The noble king, famed among the Raghus, bowed to destiny and gave his cheerful consent for Rāma to accompany Viśvāmitra.</p>  <p>Thus ended the twenty-first sarga of Bala Kanda, where the anger of a sage, the counsel of wisdom, and the surrender of a father set the path for Rāma’s first step toward his divine mission.</p>",
        "**<u>The Twenty-Second Sarga of Bala Kanda: Rāma and Lakṣmaṇa Depart with Viśvāmitra and Receive Sacred Knowledge</u>** <p>Following the counsel of sage Vasiṣṭha, King Daśaratha, with a heart full of cheer, summoned his beloved sons Rāma and Lakṣmaṇa. With blessings, mantras, and heartfelt farewells, the king sanctified their departure, placing them under the guidance of the great sage Viśvāmitra. The gentle breeze of Sarayu caressed the lotuseyed brothers as they set forth, accompanied by the sounds of celestial drums, conches, and showers of flowers, honoring the grandeur of the moment.</p>  <p>Viśvāmitra led the way, with Rāma, bow in hand, and Lakṣmaṇa following closely, their youth and valor shining like radiant sons of the god of fire. Equipped with bows, quivers, and scimitars, their appearance was faultless and resplendent, illuminating the ten directions as they walked like mighty serpents accompanying their revered teacher.</p>  <p>After crossing more than half a yojana along the southern bank of the Sarayu, Viśvāmitra addressed Rāma with gentle words and presented him with water. He conferred upon the prince the sacred knowledge of **Bala** (strength) and **Atibala** (superior strength), assuring him that with these gifts, he would experience neither fatigue, hunger, nor harm from any rakshasa. The sage extolled Rāma’s unmatched prowess, virtue, wisdom, and fortune, declaring that none in the three worlds would rival him once he mastered these divine sciences. Nourished with devotion and austerity, these powers would manifest in multiple forms to aid the young prince in his destiny.</p>  <p>Rāma received the sacred knowledge with a joyful heart, purified by the water and blessed by the sage. That day, after serving their teacher with devotion, Rāma and Lakṣmaṇa rested by the riverbank, their spirits uplifted and minds at ease, as if they were sleeping in utmost comfort despite the unaccustomed bed of grass.</p>  <p>Thus ended the twenty-second sarga of Bala Kanda, where the sacred teachings of a sage, the blessings of a father, and the courage of young princes merged, preparing Rāma and Lakṣmaṇa for the heroic journey that lay ahead.</p>",
        "**<u>The Twenty-Third Sarga of Bala Kanda: Rāma and Lakṣmaṇa Visit the Sacred Hermitage of Kāma and Receive Hospitality</u>** <p>At daybreak, the eminent sage Viśvāmitra awoke Rāma and Lakṣmaṇa, who were resting on a bed of leaves, and urged them to rise and perform their morning oblations and daily rites. Obedient and heroic, the two princes bathed in the river, offered water to the Sun, and recited sacred mantras. Having completed their morning duties, they stood before Viśvāmitra, prostrated in reverence, and prepared for their onward journey.</p>  <p>As they traveled, the heroic brothers beheld the confluence of the sacred Sarayu and divine Ganga, flowing in three branches. There they saw a venerable hermitage, home to sages of immense vitality performing austere penances for thousands of years. Exceedingly delighted, Rāma and Lakṣmaṇa inquired from Viśvāmitra about the hermitage and its inhabitants. Smiling gently, the sage recounted the tale of Kandarpa, the god of love—known as Kāma—who, while in human form, had once insulted Lord Śiva during his penance. In righteous wrath, Śiva had destroyed Kāma’s physical form, leaving him disembodied, and the hermitage thereafter became holy, inhabited by virtuous ascetics free from sin.</p>  <p>Viśvāmitra informed the princes that they would stay at this sacred hermitage that night and cross the Ganga the following day. Having performed morning ablutions, oblations, and japa, the princes entered the hermitage, where the resident ascetics, recognizing their virtue and heroism, received them with delight. They offered respectful hospitality, water for washing feet, and shared evening prayers and discourse. The charming tales of the preceptor, the son of Kuśika, enchanted Rāma and Lakṣmaṇa, filling their hearts with joy and preparing them for the spiritual and martial training to come.</p>  <p>Thus ended the twenty-third sarga of Bala Kanda, where the journey of the heroic brothers brought them to the sacred hermitage of Kāma, setting the stage for their divine learning and the unfolding of their destiny.</p>",
        "**<u>The Twenty-Fourth Sarga of Bala Kanda: Rāma and Lakṣmaṇa Learn of the Sacred Rivers, the Dreadful Forest, and the Yakṣiṇī Tataka</u>** <p>At daybreak, after performing their morning oblations, Rāma and Lakṣmaṇa, accompanied by Viśvāmitra, arrived at the banks of the Ganga. The ascetics of the riverbank had secured a safe and auspicious boat for them. They were instructed to board the boat with the princes and to take a safe path without delay. Respectfully paying obeisance to the sages, Viśvāmitra crossed the river with the two brothers, and as they reached midstream, they heard a thunderous noise caused by the confluence of the Sarayu and Ganga. Curious, Rāma asked Viśvāmitra the cause of the tumultuous sound. The sage explained that the Sarayu flows from the Manasa lake on Mount Kailasa, created by Brahma, and where it meets the Ganga, the collision of waters produces that mighty noise. Viśvāmitra advised Rāma to offer respectful salutations at that point.</p>  <p>After making obeisance to the rivers, the brothers reached the southern bank and proceeded further. They came upon a dreadful and untrodden forest, filled with the shrill cries of birds and the roars of lions, tigers, elephants, boars, and other creatures. The dense forest was overgrown with trees such as dhava, ashvakarna, kakubha, bilva, tinduka, patala, and badari, making it extremely forbidding.</p>  <p>Viswamitra then narrated the history of this forest. He explained that long ago, the prosperous towns of Malada and Karusha had been built by celestial architects. After the slaying of Vṛtrasura, Indra, affected by the sin of killing a Brahmin and hunger, was purified by the devatas and sages at this very place. Pleased, Indra blessed the land, and the towns became fertile and renowned. Later, the forest was overtaken by a fearsome yakshini named Tataka, wife of the intelligent Sunda and mother of the rakshasa Maricha. Tataka, possessing the strength of a thousand elephants and the power of Indra, lived in this forest, terrifying the inhabitants and rendering the path impassable.</p>  <p>Viswamitra instructed Rāma that by his own strength, he must slay this wicked Yakshini, Tataka, and make the land safe and habitable again. The sage emphasized that none dared enter this forest because of her dreadful and intolerable power. This explanation made Rāma fully aware of the danger that awaited in the forest and set the stage for the encounter with Tataka.</p>  <p>Thus ends the twenty-fourth sarga of Bala Kanda, where the brothers, guided by Viśvāmitra, learn of the sacred rivers, the fearsome forest, and the formidable Yakshini Tataka that must be vanquished.</p>",
        "**<u>The Twenty-Fifth Sarga of Bala Kanda: Viśvāmitra Explains Tataka’s Origins and the Duty of Rāma to Uphold Dharma</u>** <p>After hearing the sage Viśvāmitra’s words, Rāma, though curious, expressed doubt, saying: “O best of ascetics, I have heard that yakshas possess little prowess. How can a woman, who is by nature weak, have the strength of a thousand elephants?”</p>  <p>Viśvāmitra then explained how Tataka acquired her extraordinary strength. He narrated that in the past, a great and powerful yaksha named Suketu, who was childless, performed intense penance following virtuous practices. Brahmā, pleased with Suketu’s devotion, granted him a daughter, Tataka, as a gem of a child. To Tataka, Brahmā granted the strength of a thousand elephants, though no son was given to Suketu. As Tataka grew, radiant with youth and beauty, she was married to Sunda, son of Jharjha.</p>  <p>Later, Tataka gave birth to a son named Maricha, who became a rakshasa due to a curse. When Sunda was slain, Tataka, along with her son, sought to attack the sage Agastya. Roaring to devour him, she was confronted by Agastya, who, in wrath, cursed Tataka to abandon her original form and assume a fearsome rakshasi figure—a cannibal with a hideous, distorted appearance. Enraged by the curse, Tataka began to ravage the land, causing havoc to the inhabitants.</p>  <p>Viśvāmitra then instructed Rāma: “O Rama, for the welfare of the brahmins and cows, slay this wicked yakshini, Tataka, who is extremely cruel and possesses vile prowess. She is cursed and, therefore, no one in the three worlds except you is capable of defeating her. You need not feel pity for killing a woman, for as a prince, it is your duty to act for the protection of society and the four orders of people. Whether an act appears cruel, harmless, sinful, or mistaken, if it serves the welfare of your subjects, it is righteous. This is the eternal law for those appointed to bear the burden of kingship. O Kakustha, slay Tataka, for she knows no dharma.”</p>  <p>To strengthen his argument, Viśvāmitra cited past examples: Indra had slain Manthara, daughter of Virochana, who intended to destroy the earth; Vishnu had destroyed Kavya, the wife of sage Bhrigu, who threatened Indra. “Thus, O prince,” said Viśvāmitra, “in history, several unrighteous women have been slain by magnanimous men for the greater good.”</p>  <p>Thus ends the twenty-fifth sarga of Bala Kanda, where Viśvāmitra convinces Rāma of his duty to slay Tataka, explaining her origins, her curse, and the righteousness of his impending action.</p>",
        "**<u>The twenty-sixth Sarga of Bala Kanda: Sri Rama Kills Tataka</u>** <p>After listening to the sage Viśvāmitra’s instructions, Rāma, firm in his vows and of the Raghu lineage, replied with folded palms:</p>  <p>“To fulfill my father’s command, to honor his words, and to obey the instructions of Kausika (Viśvāmitra), I shall carry out this task without hesitation. In Ayodhya, in the presence of elders and sages, I cannot disobey my father’s command. As per my father’s words and your instructions, I shall perform the righteous act of slaying Tataka. For the welfare of cows and brahmins and for the good of this land, I am prepared to execute your command.”</p>  <p>Having spoken thus, Rāma, the destroyer of enemies, drew his bow with a mighty twang, the sound of which spread terror across the forest. Tataka, enraged and amazed by the sound, rushed toward him. Observing her, Rāma turned to Lakṣmaṇa and said: “Behold, Lakṣmaṇa, the dreadful hideous form of this yakshini. Her appearance will break timid hearts. She is unassailable due to her magical powers. Today I shall deprive her of her prowess and strength, though I am not inclined to slay a woman by nature.”</p>  <p>Infuriated, Tataka raised a cloud of dust and hurled boulders at Rāma and Lakṣmaṇa, attempting to bewilder them. She then employed her magical powers to shower a rain of boulders, moving fearfully in various forms to confuse the princes. Rāma, skilled in archery and sound-based targeting, countered her attack with a volley of arrows. When she advanced toward them like a thunderbolt, Rāma pierced her chest with an arrow, and she fell dead. Lakṣmaṇa then cut off her hands, ears, and the tip of her nose in indignation as she roared in fury.</p>  <p>Having slain Tataka, Rāma was praised by Indra and the celestials for his valor, who declared, “Well done, well done!” They expressed their gratitude to Viśvāmitra and love for Rama. Viswamitra, pleased with Rāma’s act, fondly kissed his forehead and said, “Tonight we shall stay here. Tomorrow morning, we shall proceed to my hermitage.”</p>  <p>Rāma spent the night happily in the Tataka forest, which, freed from the curse, now appeared charming and radiant like Chitraratha Kubera’s garden. At dawn, he was awakened by Viśvāmitra and continued his journey.</p>  <p>Thus ends the twenty-sixth Sarga of Bala Kanda, where Rāma slays Tataka, restores order to the forest, and gains the blessings of the celestials for his righteous action.</p>",
        "**<u>The twenty-seventh Sarga of Bala Kanda: Viśvāmitra Confers Celestial Weapons on Rāma</u>** <p>After the night had passed, the illustrious sage Viśvāmitra, smiling with great affection, called Rāma to him. With a voice full of sweetness, he addressed the young prince: “O Rāma, prince of great renown, I am exceedingly pleased with you. May you prosper. Out of deep love and devotion, I shall grant you all the celestial weapons for your protection and victory in battle.”</p>  <p>Viśvāmitra continued, “With these divine weapons, O Rāma, you will be able to vanquish even the gods, demons, serpents, and gandharvas should they oppose you. You will subdue your enemies and take them captive. May these gifts ensure your triumph and welfare.”</p>  <p>Then, the sage enumerated the mighty celestial weapons he bestowed upon Rāma. He granted the powerful Danda Chakra, the Dharmachakra, Kalachakra, and Vishnuchakra. The Indra Astra, Vajra Astra, the trident of Shiva, Brahmashirsha Astra, Ishika Astra, and the incomparable Brahma Astra were also conferred. To complement these, Rāma received two shining maces called Modaki and Shikhari, the Dharma Pasa, Kala Pasa, and Varuna Pasa. Two thunderbolts named Shuska and Ardra, along with the Painaka Astra and Narayana Astra, were also entrusted to him.</p>  <p>Viśvāmitra, in his affection, further granted Rāma the Agneya Astra called Sikhara, his favored weapon, and the Vayavya Astra named Prathana. Two potent weapons, Hayasira and Krauncha Astra, were given, alongside the dreadful Kankala, the pestle Kapala, and the Kankana, commonly wielded by asuras. The Maha Astra, Vaidyadhara Astra, and the excellent Nandana Scimitar were entrusted to him, as well as the Gandharva Astra called Manava and the Saura Astra, capable of inducing and suppressing sleep. Rāma also received the Darpaṇa, Soshana, Santhapana, Vilapana, Madana Astra, and the Paisacha Astra, the Tamasa and Saumana Astras, the Samavardha weapon, Mausala, Satya Astra, Mayadhara Astra, Teja Prabha Astra, Sisira Astra, Twashtu Astra, Bhaga’s Shiteshu Astra, and the Manava Astra, all supremely powerful and capable of assuming any form at Rāma’s command.</p>  <p>Having conferred these extraordinary weapons, Viśvāmitra purified himself and, facing east, gave Rāma the preeminent collection of mantras associated with them. These mantras were so rare and potent that even the celestials found them difficult to acquire. As the sage chanted the sacred syllables, the venerable weapons themselves, guided by their presiding deities, attended upon Rāma, ready to serve him whenever he invoked them.</p>  <p>The presiding deities of the weapons, folding their palms in reverence, spoke to Rāma: “O Rāma, we are here, at your service, prepared to act upon your command.” Rāma, born in the noble race of Kakutstha, received the weapons, touching them with his hands and mentally commanding them to reside in his mind, ready to aid him whenever he wished.</p>  <p>With a heart full of joy and gratitude, Rāma bowed respectfully to the mighty ascetic Viśvāmitra and prepared to continue his journey. Cheered by the sage’s affection and armed with divine weapons and sacred mantras, Rāma, the heroic prince of the Raghu lineage, set forth, ready to fulfill the righteous tasks that lay ahead.</p>  <p>Thus ends the twenty-seventh Sarga of Bala Kanda of the holy Ramayana, where Viśvāmitra, pleased with Rāma’s valor and righteousness, conferred upon him all the celestial weapons and mantras, preparing the prince for the heroic deeds to come.</p>",
        "**<u>The twenty-eighth Sarga of Bala Kanda: Viśvāmitra Teaches Rāma the Methods of Invoking, Dispatching, and Withdrawing the Astras</u>** <p>After performing the purificatory rites, the young and heroic Rāma, born in the Raghu lineage, received the celestial weapons with a cheerful and delighted heart. As he walked along with Viśvāmitra, he addressed the sage with folded palms: “O venerable one, having received these weapons, I feel invincible even against the celestials. O best of ascetics, I am desirous of learning the method to withdraw these astras once invoked.”</p>  <p>Patient and wise, Viśvāmitra, the great ascetic, possessing fortitude and bound by excellent vows, instructed Rāma in the proper mantras and techniques for invoking, directing, and withdrawing each weapon. With deep care, he enumerated the effulgent astras, each imbued with celestial power: Satyavanta, Satyakirti, Dhrishta, Rabhasa, Pratiharatara, Paranmukha, Avanmukha, Lakshaksha, Vishama, Drudhanabha, Sunabha, Dasaksha, Satavaktra, Dasasheersha, Satodara, Padmanabha, Mahanabha, Dundunabha, Sunabhaka, Jyotisha, Krusana, Nairasya, Vimala, Yogandhara, Haridra, Daitya Prasamana, Sarchirmali, Dhriti, Mali, Vrttiman, Ruchira, Pitrusaumanasa, Vidhuta, Makara, Karaveera, Dhana, Dhanya, Kamarupa, Kamaruchi, Moha, Avarana, Jrumbhaka, Sarvanabha, and Santhana Varana. Viśvāmitra told Rāma that these weapons, effulgent and mighty, capable of assuming any form at will, were now worthy of him and would bring him prosperity when called upon.</p>  <p>Rāma, delighted, accepted the astras with a heart full of joy. Some of the astras assumed radiant and divine forms, some appeared black like coal, some like smoke, while others shone like the Sun or Moon. Assuming corporeal forms and bending in reverence, the weapons themselves spoke to Rāma in sweet and gentle tones: “O tiger among men, here we are. Command us, and we shall act according to your wish.”</p>  <p>Rāma, understanding the divine instructions, addressed the weapons: “Reside within my mind and render assistance whenever I am in need. Now go to your respective abodes, but remain ever ready at my command.” Obedient to his words, the celestial astras circumambulated Rāma, paid their respects, and returned to the realms from which they had come.</p>  <p>Having acquired full knowledge of these mighty astras, Rāma walked with the great sage Viśvāmitra, speaking to him in gentle and reverent words. He observed the surrounding landscape and spoke in wonder: “O revered sage, from this side of the mountain, not far from here, I see a region adorned with shining trees resembling clouds, teeming with animals, and extremely beautiful. Birds of various kinds sing sweetly from the branches. This sight fills me with great curiosity. Whose hermitage is this? Please tell me.”</p>  <p>Rāma further inquired: “O great ascetic, from where have come those wicked and sinful beings who slay Brahmanas and create obstacles to sacred sacrifices? Where is the place that must be protected, and where are these rakshasas who are to be vanquished? O best among ascetics, I wish to hear all about this.”</p>  <p>Thus ends the twenty-eighth Sarga of Bala Kanda of the holy Ramayana, where Rāma receives the profound knowledge of invoking, directing, and withdrawing celestial weapons, and, guided by Viśvāmitra, prepares to confront the wicked rakshasas troubling sacred rites.</p>",
        "**<u>The twenty-ninth Sarga of Bala Kanda: Visvāmitra Relates the Story of Siddhashrama and the Rishis Worship Him</u>** <p>When Rāma, the mighty-armed scion of Raghu, inquired about the forest, the highly lustrous sage Viśvāmitra, full of knowledge and grandeur, began to explain its significance. He told Rāma that in this very forest, the Supreme Lord Viṣṇu, the foremost of the gods, had lived as a great ascetic for countless years, performing yogic practices and penance through hundreds of yugas. This sacred place, known as Siddhashrama, had been the hermitage of the glorious Vāmana, who had attained perfection through rigorous austerities.</p>  <p>Viśvāmitra recounted how, during the period of Vāmana’s penances, King Bali, son of Virochana, having vanquished Indra and the Maruts, ruled the three worlds and became famed everywhere. While Bali performed a great sacrifice, the devas, led by Agni, approached Lord Viṣṇu at this hermitage, seeking that their purpose be fulfilled even before the completion of Bali’s yajña. They entreated Viṣṇu, who, for the welfare of the devas, assumed the form of Vāmana through the power of illusion, performing a supreme and auspicious act.</p>  <p>In the meantime, sage Kashyapa, radiant like fire and accompanied by the goddess Aditi, having completed a thousand divine years of penance, pleased Lord Viṣṇu, and extolled him, saying: “You are the embodiment of tapas, O Purushottama. I behold the entire universe in your body. You are beginningless and indescribable. I take refuge in you.” Lord Viṣṇu, pleased with Kashyapa, granted him a boon. Upon hearing this, Kashyapa, son of Maricha, humbly requested Viṣṇu to be born as a son to Aditi and himself, to be a younger brother to Indra, and to help the devas afflicted by sorrow.</p>  <p>Viśvāmitra explained that this ashrama, blessed by the presence of Vāmana, had become Siddhashrama by divine grace. However, wicked rakshasas had begun to trouble this hermitage, causing obstacles to the righteous. The sage now sought Rāma’s aid to restore the sanctity of Siddhashrama.</p>  <p>With these words, Viśvāmitra invited Rāma and Lakṣmaṇa to visit the unparalleled Siddhashrama. As they entered, the hermitage appeared resplendent, shining like the moon in conjunction with the Punarvasu star, the mist clearing to reveal its divine beauty. The ascetics dwelling there, seeing the great sage Visvāmitra, immediately leapt from their abodes and offered him their worship. In the same fitting manner, they extended hospitality to the two princes, Rāma and Lakṣmaṇa, honoring them as guests.</p>  <p>After resting for a while, the young princes, with folded palms, addressed the great sage: “O foremost of ascetics, today itself let the initiation ceremony be performed. May this Siddhashrama attain perfection, and may your words come true.” Satisfied with their devotion, the illustrious Visvāmitra, effulgent and self-disciplined, engaged in the sacred initiation rites with restrained senses. The princes, spending the night in composure, woke at daybreak, performed their ablutions, recited prayers, and respectfully paid homage to Visvāmitra seated at the kindled sacrificial fire.</p>  <p>Thus ends the twenty-ninth Sarga of Bala Kanda, where Viśvāmitra recounts the sacred history of Siddhashrama, the hermitage’s divine origin, and the birth of Vāmana, while all the resident sages offer worship to the sage and welcome the young princes with devotion and honor.</p>",
        "**<u>The thirtieth Sarga of Bala Kanda: Śrī Rāma Slays Rakṣasas and Protects the Sacrifice of Viśvāmitra</u>** <p>As the highly illustrious princes Rāma and Lakṣmaṇa, well-versed in time and place and capable of subduing enemies, addressed the sage Viśvāmitra, they expressed their readiness to defend the sacrifice from the approaching rakṣasas. They inquired about the precise moment of the rakṣasas’ arrival, so that the sacred ceremony could be protected without delay. The sages, pleased by their courage and eagerness to fight, entrusted the protection of the Tapovana and the initiated ceremony to the two princes for six days and nights, during which the sage would observe strict silence.</p>  <p>Without hesitation, the illustrious Rāma and Lakṣmaṇa took up their vigil, protecting the hermitage tirelessly. On the sixth day, Rāma, ever vigilant, cautioned Lakṣmaṇa to be prepared. As the sacrificial fire blazed brightly, attended by Viśvāmitra, the officiating priests, and sacred implements, a terrifying sound echoed from the sky. Two rakṣasas, Mārīca and Subāhu, accompanied by their followers, appeared with fearsome visages, covering the sky in illusion and raining streams of blood upon the altar.</p>  <p>Rāma, seeing the rakṣasas advance, addressed Lakṣmaṇa: “Behold these wicked, flesh-eating rakṣasas. I shall hurl the Manava-āstra upon them like clouds scattered by the wind.” Enraged and effulgent, Rāma struck Mārīca with the powerful Manava-āstra, hurling him a hundred yojanas away into the surging ocean, leaving him unconscious but alive. He then explained to Lakṣmaṇa how the righteous Manava-āstra incapacitates its target without taking life.</p>  <p>Determined to protect the sacrifice, Rāma next seized the celestial Agneya-āstra and hurled it at Subāhu, striking him down. The remaining rakṣasas were slain with the Vāyavya-āstra, bringing immense delight to the resident ascetics. Through his courage and martial skill, Rāma, the illustrious scion of Raghu, vanquished all rakṣasas obstructing the sacrifice, and the sages offered him worship as Indra had been honored in times past.</p>  <p>When the yajña was finally completed, the great sage Viśvāmitra, beholding all directions freed from evil, praised Rāma: “O mighty-armed one, I am fulfilled. By your prowess, your father’s command has been accomplished, and this Siddhashrama has truly lived up to its sacred name.”</p>  <p>Thus ends the thirtieth Sarga of Bala Kanda, where Rāma and Lakṣmaṇa, through their valor and devotion, protect the sacred sacrifice, vanquish the rakṣasas, and bring glory to the hermitage, earning the heartfelt praise of the venerable Viśvāmitra.</p>",
        "**<u>The thirty-first Sarga of Bala Kanda: Viśvāmitra, Accompanied by Rāma and Lakṣmaṇa, Departs for Mithilā and Halts at the Bank of Sona</u>** <p>Having fulfilled their purpose at Siddhashrama, the heroic brothers Rāma and Lakṣmaṇa spent the night in joy and contentment. At dawn, they performed the morning rites and approached the sage Viśvāmitra along with other rishis. Saluting the best of ascetics, shining like a flaming fire, they addressed him with sweet and generous words, offering themselves as obedient servants ready to follow his commands.</p>  <p>Viśvāmitra, placing Rāma in the forefront, informed him of their forthcoming journey to Mithilā, where King Janaka, the foremost among men, was to perform a great and righteous sacrifice. He invited Rāma to accompany them, promising that the prince would witness the extraordinary bow of Janaka, a divine instrument bestowed by the gods, possessing immeasurable strength and incomparable lustre, which no god, gandharva, asura, rakṣasa, or human could string. This bow, the sage explained, was the supreme fruit of Janaka’s yajña, worshipped with perfumes, incense, and fragrant agaru.</p>  <p>Having instructed the princes, Viśvāmitra commenced the onward journey with the company of rishis and sylvan deities. They proceeded northward, leaving Siddhashrama after circumambulating it in reverence. The Vedic scholars accompanied them in nearly one hundred carriages, while the birds and beasts of the forest followed for a distance until sent back by the sage. At sunset, the sages halted on the bank of the river Sona, bathed, offered oblations, and seated themselves in front of Visvāmitra. Rāma and Lakṣmaṇa, having respectfully saluted the sages, also sat in front of the sagacious Viśvāmitra.</p>  <p>Filled with curiosity, the highly illustrious Rāma inquired of the sage about the region, noting its shining and luxuriant groves. Urged by Rāma’s words, Viśvāmitra, a sage of rigid austerities and excellent vows, narrated the entire story of the region, describing its sacred and remarkable features to the assembled rishis.</p>  <p>Thus ends the thirty-first Sarga of Bala Kanda, where Viśvāmitra, with Rāma and Lakṣmaṇa, departs for Mithilā, halts on the bank of Sona, and begins to recount the sacred history of the lands they traverse.</p>",
        "**<u>The Thirty-Second Sarga of Bala Kanda: The Sons of Brahma, the Dynasty of Kusanabha, and the Curse of the Windgod</u>** <p>A great ascetic named Kusa, born of Brahma, was indefatigable in vows, conversant with dharma, and respectful of the virtuous. He married a noble princess of Vidarbha and begot four virtuous sons—Kusamba, Kusanabha, Adhurtarajas, and Vasu—who were lustrous, enthusiastic, pious, truthful, and eager to perform the duties of the warrior class. Kusa instructed them to govern righteously, and following the rishi’s words, the four sons, revered as the best among men, established four cities as their abodes: Kusamba built Kaushambi, Kusanabha built Mahodaya, Adhurtarajasa built Dharmaranya, and Vasu built Girivraja. Vasu’s kingdom, called Vasumati, was surrounded by five shining mountains and adorned by the renowned river Sumagadhi, flowing like a garland of fertility and prosperity.</p>  <p>Rajarshi Kusanabha, virtuous and righteous, had one hundred extraordinarily beautiful daughters with a nymph named Ghritachi. In the pleasure gardens, these maidens, adorned with ornaments, sang, danced, played instruments, and moved gracefully, shining like lightnings or stars among clouds. Witnessing them, the all-pervading Windgod, enamored, proposed that they become his wives, promising them eternal youth and long life beyond mortal bounds.</p>  <p>The maidens, however, rebuked the Windgod, asserting that he was insulting their father, Kusanabha, who was righteous and truthful. They reminded him that they would marry only the bridegroom chosen by their father, who governed righteously. Infuriated by their defiance, the powerful Windgod entered their bodies and twisted them, disfiguring them into humpbacked forms. Agitated and ashamed, the maidens entered their father’s palace, tears in their eyes, distressed and disfigured. Seeing his beloved daughters in such a state, King Kusanabha was bewildered and deeply agitated. He inquired urgently who had dishonored virtue and caused his daughters to become humpbacked, standing silently before him. The king then heaved a sigh and entered a state of deep meditation (samadhi), pondering the calamity that had befallen his daughters.</p>  <p>Thus ends the thirty-second sarga of Bala Kanda in the holy <i>Rāmāyaṇa</i> of sage Vālmīki, recounting the genealogy of Kusanabha and the tragic curse of the Windgod upon his daughters.</p>",
        "**<u>The Thirty-Third Sarga of Bala Kanda: Kusanabha Praises His Daughters, the Birth of Brahmadatta, and Their Marriage</u>** <p>On hearing their father Kusanabha’s wise words, his hundred daughters touched his feet with their heads and explained the situation. They described how the all-pervading Windgod had attempted to outrage them by foul means, disregarding morality. They insisted that they could not act freely, for their father alone had the authority to give them in marriage. By defying the Windgod, they were protecting their dharma and the honour of their lineage. However, the Windgod, ignoring their words, had assaulted them. </p>  <p>Kusanabha, deeply virtuous and powerful, praised his daughters for their courage, tolerance, and unity in protecting family honour. He reminded them that forgiveness and forbearance are ornaments of character, difficult even for gods, and that the universe itself is upheld by forbearance. Recognizing their extraordinary virtue, he commended their actions as praiseworthy and righteous.</p>  <p>After sending his daughters, Kusanabha consulted his ministers to find a suitable husband for them at the proper time and place. At this time, a great ascetic named Chuli, devoted to celibacy and performing austerities for the knowledge of Brahman, was being served by a Gandharva maiden named Somada. Pleased with her service, Chuli granted her an excellent son born through the power of his mind, named Brahmadatta.</p>  <p>Brahmadatta, endowed with great prosperity and residing in the city of Kampilya, was later chosen by King Kusanabha as the husband for his hundred daughters. With great joy, Kusanabha invited Brahmadatta and gave his daughters to him in marriage, in proper ritual and assembly of priests. Upon receiving his wives, Brahmadatta’s mere touch cured the daughters of their humpbacks and anguish, restoring their beauty and splendour.</p>  <p>King Kusanabha was immensely pleased to see his daughters released from the Windgod’s curse and rejoiced greatly. The marriage was performed with full ritual, and the daughters went to their husband Brahmadatta, bringing delight and praise from the Gandharva maiden Somada for the proper and righteous conduct of her son.</p>  <p>Thus ends the thirty-third sarga of Bala Kanda in the holy <i>Rāmāyaṇa</i> of sage Vālmīki, recounting the courage of Kusanabha’s daughters, the birth of Brahmadatta, and the joyous and righteous marriage of the hundred daughters to him.</p>",
        "**<u>The Thirty-Fourth Sarga of Bala Kanda: The Birth of Gadhi, Praise of the Kausika Lineage, and Description of Midnight</u>** <p>After the marriage of Brahmadatta and his departure to his kingdom, King Kusanabha, being without a son, performed a putreshti (ritual to beget a son). While the ritual was in progress, Kusa, the highly generous son of Brahma, appeared and spoke to Kusanabha, assuring him that a virtuous son named Gadhi, similar to himself, would be born. This son would bring everlasting fame to Kusanabha’s lineage.</p>  <p>Following this blessing, Kusa departed to the eternal Brahmaloka. After some time, a supremely righteous son named Gadhi was born to Kusanabha. Gadhi became the father of the sage Kausika. Kausika recounts to Rama that his elder sister Satyavati, known for her virtue and devotion, was married to Richika and, following her husband, attained heaven. She assumed the form of a sacred river, the Kausiki, flowing from the Himavat mountains to benefit humanity and the world.</p>  <p>Kausika further narrates that, for the observance of austerities, he had come to the Siddha ashrama and, through Rama’s valor, fulfilled his desire. He shared the origin of his family, the history of his lineage, and the significance of the Kausiki river. He describes the midnight scene: the trees are still, animals and birds are calm, darkness pervades the directions, stars gleam in the sky, and the moon rises with its cool, delightful light. Nocturnal beings, including yakshas, rakshasas, and dreadful flesh-eaters, move about quietly.</p>  <p>Having spoken, the great and highly lustrous ascetic rested. All the sages praised him, saying “Well said, well said.” Kausika’s lineage, the family of Kusa, is venerable and always devoted to dharma, with its men esteemed like Brahma. Sage Visvamitra, highly illustrious, is told that among rivers, the Kausiki is the best, glorifying his dynasty. In this way, the auspicious son of Kausika, praised by the best of ascetics, went to sleep like the radiant sun setting behind the Asta mountains. Rama and Lakshmana, with admiration and wonder, also enjoyed the peaceful sleep of the great ascetic.</p>  <p>Thus ends the thirty-fourth sarga of Bala Kanda in the holy <i>Rāmāyaṇa</i> of sage Vālmīki, recounting the birth of Gadhi, the lineage of Kausika, and the serene description of midnight in the ashrama.</p>",
        "**<u>The Thirty-Fifth Sarga of Bala Kanda: Viswamitra Narrates the Legend of the Sacred Ganga</u>** <p>Viswamitra, along with the ascetics, spent the night on the banks of the river Sona. At daybreak, he addressed Rama, telling him that the night had passed and dawn had arrived. It was time for morning rituals, and Rama, along with Lakshmana, prepared for their onward journey.</p>  <p>Rama observed the river Sona, noting its deep and auspicious waters adorned with sandbanks, and inquired how they should cross it. Viswamitra advised taking the path the ascetics had used. Following the guidance of the wise sage, they proceeded through various forests. After traveling for half a day, they reached the sacred river Jahnavi (Ganga), renowned and worshipped by sages. Seeing the river with swans and cranes gliding over its sacred waters, all the sages, including Rama and Lakshmana, were delighted.</p>  <p>They settled on the riverbank, bathed in the waters, offered traditional oblations to the ancestors, performed agnihotra sacrifices, and partook of the offerings, surrounding Viswamitra with joyful hearts.</p>  <p>Rama then expressed his desire to hear the story of Ganga, the river that flows in three directions, purifying the three worlds before entering the ocean. Prompted by Rama’s question, Viswamitra began narrating her birth and progress. He explained that the great mountain Himavan, a treasure of minerals, had two beautiful daughters. The eldest, Ganga, was born to Himavan’s beloved Manorama, and the second daughter was Uma.</p>  <p>The devas, wishing to gain benefits for the worlds, requested Himavan to grant his eldest daughter Ganga, flowing in three directions, for the welfare of all. Rooted in dharma and desiring the good of the three worlds, Himavan gifted Ganga, who sanctifies the earth by her free course. The devas received Ganga with a sense of fulfillment and returned to their abodes. The other daughter, Uma, endowed with severe austerities and revered by the world, was given in marriage to the mighty Rudra.</p>  <p>Thus, Ganga, the holiest of rivers, and Uma Devi, both daughters of Himavan, are worshipped by the entire world. Viswamitra concluded by narrating how Ganga, flowing across the three worlds, first reached the heavens, becoming the celestial river adored by the gods.</p>  <p>Thus ends the thirty-fifth sarga of Bala Kanda in the holy <i>Rāmāyaṇa</i> of sage Vālmīki, recounting the legend of the sacred river Ganga and the birth of Uma Devi.</p>",
        "**<u>The Thirty-Sixth Sarga of Bala Kanda: Obstacles to Maheswara and Parvati’s Marital Bliss</u>** <p>While Viswamitra was narrating the story of Ganga to Rama and Lakshmana, they praised the account and requested the sage to narrate further details regarding the eldest daughter of Himavan and her deeds in both the celestial and mortal worlds. They inquired why Ganga, the purifier of the worlds, flows in three directions and what deeds endowed her with such renown across the three worlds.</p>  <p>Prompted by Rama, Viswamitra, the ascetic endowed with penance, narrated the complete story to the sages present. He began by describing how, in ancient times, the mighty ascetic Lord Siva, the blue-throated Mahatapa, married Goddess Uma. Despite a hundred years of conjugal union, no offspring was born to them. The devatas, led by Brahma, grew alarmed, fearing the immense power of the child that could be born. They approached Mahadeva with their salutations and advised him to preserve his energy (vital fluid) in his body through penance with Uma, so that the three worlds and the Earth would remain safe and peaceful.</p>  <p>Mahadeva agreed and preserved the vital energy within his body. When questioned about what would contain this exceptional power if disturbed, the devatas replied that the Earth itself would bear it. Consequently, the energy pervaded the Earth, including mountains and forests, and from it, the glorious Kartikeya was eventually born in the Saravana forest, blazing like fire or the Sun. Pleased with these events, the devatas and sages worshipped Siva and Uma with deep devotion.</p>  <p>However, Uma, daughter of the mountain Himavan, angry at the devatas for creating obstacles in her union with Mahadeva and preventing the birth of their offspring, cursed them. She declared that from that day forward, the wives of the devatas would remain childless, and even the Earth would assume many forms and become the wife of many masters. Because of her anger, the Earth would not experience the joy of bearing a son.</p>  <p>Seeing the devatas humbled by Uma’s curse, Mahesvara (Siva) departed to a northern peak of Himavat, accompanied by Uma, to perform penance. With this, Viswamitra concluded the narration of this portion and informed Rama that the detailed story of Ganga’s birth would follow next.</p>  <p>Thus ends the thirty-sixth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the devatas’ interference in Maheswara and Parvati’s marital bliss and Uma’s subsequent curse.</p>",
        "**<u>The Thirty-Seventh Sarga of Bala Kanda: The Birth of Karttikeya</u>** <p>In ancient times, while Lord Siva (Iswara) was engaged in penance with Uma, the devatas, along with the sages, approached Lord Brahma to obtain an army general for their forces. Led by Indra and Agni, the devatas respectfully saluted Brahma and explained that due to Uma’s curse, Siva could not procreate a general in the usual way. They requested Brahma to guide them on how to proceed for the welfare of the worlds.</p>  <p>Brahma consoled the devatas and revealed that Ganga, flowing in the celestial regions, would be the means for the Firegod (Agni) to beget a son, who would serve as the commander of the gods’ army. This son would be nurtured by Ganga and be acceptable to Uma. Hearing Brahma’s assurance, the devatas rejoiced and proceeded to Mount Kailasa, adorned with minerals, to request the Firegod to perform this divine work.</p>  <p>The Firegod approached Ganga and instructed her to bear the vital energy of Siva. When Ganga received this energy, she found it overwhelming and could not contain its brilliance. Agni advised her to place the embryo on the slopes of Mount Himavat. Obediently, Ganga released the resplendent embryo into her streams, and when it reached the earth, it produced pure and auspicious gold, along with copper, iron, zinc, lead, and various minerals. The forest and vegetation around glimmered like gold, giving rise to what became known as Jatarupa.</p>  <p>From this, the divine Kumara (Karttikeya) was born. The gods, with Indra and the six Krittikas as his nurses, nurtured him. The Krittikas decided among themselves that this boy would be a son to all the gods. Drinking their milk, the infant, despite his tender age, displayed extraordinary prowess and vanquished demons. With the Firegod in the forefront, the devatas installed him as the commander of their forces, shining with unsurpassed brilliance.</p>  <p>Thus, the story of Ganga and the auspicious birth of Kumara (Karttikeya), the mighty commander of the gods, was narrated. Sage Valmiki concludes this sarga by stating that whosoever on earth reveres Karttikeya with devotion shall be blessed with long life, progeny, and, after death, attain the world of Skanda.</p>  <p>Thus ends the thirty-seventh sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the birth of Kumāra (Karttikeya) and his installation as the mighty commander of the gods’ forces.</p>",
        "**<u>The Thirty-Eighth Sarga of Bala Kanda: Emperor Sagara Performs Austerities and a Sacrifice for Progeny</u>** <p>Visvamitra, the son of Kausika, having related the story of Karttikeya to Rama, continued to narrate another episode. In ancient times, there lived a brave and righteous king named Sagara, the ruler of Ayodhya, who was childless and desired progeny. His eldest wife, Kesini, daughter of the king of Vidarbha, was righteous and truthful, while his second wife, Sumati, daughter of Arishtanemi, was unsurpassed in charm.</p>  <p>King Sagara, accompanied by his wives, went to the peak of Mount Himavat called Bhriguprasravana and performed severe austerities. After a hundred years, the ascetic Bhrugu, pleased with Sagara’s devotion, granted him a boon: one wife would bear a son to perpetuate the lineage, and the other wife would bear sixty thousand sons endowed with fame and great strength.</p>  <p>The queens were delighted and respectfully inquired from Bhrugu which of them would bear the single son and which the many sons. Bhrugu, the highly virtuous sage, allowed them to choose freely. Kesini chose to have the son who would perpetuate the lineage, while Sumati chose the boon of sixty thousand sons. They then respectfully circled the sage, bowed, and returned to the capital.</p>  <p>After some time, Kesini gave birth to a son named Asamanjasa, while Sumati gave birth to a gourd-like foetus which, when it split open, produced sixty thousand sons. The sons were nurtured in pots filled with clarified butter and eventually attained youth and beauty. The eldest son, Asamanjasa, became unruly, tormenting children in the waters of the Sarayu river, and was eventually banished for his misdeeds. His son, Anshuman, however, was valiant, beloved, and courteous to all.</p>  <p>After a long period, King Sagara resolved to perform a great sacrifice. Well-versed in the Vedas, he commenced the initiatory rites of the sacrifice in the company of learned priests, determined to fulfill his sacred vow.</p>  <p>Thus ends the thirty-eighth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting King Sagara’s austerities, the birth of his sons, and his preparation for a great sacrifice to obtain progeny.</p>",
        "**<u>The Thirty-Ninth Sarga of Bala Kanda: Indra Steals the Sacrificial Horse; Sons of Sagara Search the Earth</u>** <p>Having heard Visvamitra’s words, Rama, immensely pleased, addressed the sage at the end of the narration. He expressed his desire to hear in detail how his ancestors, particularly King Sagara, prepared for the sacrifice. Smiling, Visvamitra obliged, saying, “O Rama, hear in detail the story of the magnanimous King Sagara.”</p>  <p>The sacrifice was arranged in the region between the mountains Himavat and Vindhya. This area was suitable for sacrificial acts. Anshuman, Sagara’s valiant son and great charioteer, followed the sacrificial horse to protect it. On the concluding day of the fortnight, Indra (Vasava), assuming the form of a rakshasa, stole Sagara’s sacrificial horse.</p>  <p>The priests, seeing the theft, urged King Sagara to act quickly: “O Kakutstha, the sacrificial horse has been stolen. Slay the thief and bring the horse back. Any flaw in this sacrifice will be inauspicious. Do everything to ensure the sacrifice remains flawless.”</p>  <p>Hearing the words of the priests, King Sagara summoned his sixty thousand sons and instructed them: “Go and search the entire earth surrounded by oceans. Acquire every yojana of land, excavate the earth yojana by yojana, and find the thief of the horse. Continue until the horse is recovered.”</p>  <p>Having been initiated into the sacrifice, King Sagara, along with his grandson Anshuman and the priests, stayed at the sacrificial site while his sons departed with joyful hearts to obey their father’s command. Each son dug the earth with nails sharp as diamonds, breaking the ground with lances and ploughs. This caused dreadful sounds to emanate from the earth, churning serpents, demons, rakshasas, and all living beings.</p>  <p>The heroic sons of Sagara excavated sixty thousand yojanas of earth, reaching the nether worlds, and moved everywhere while excavating the mountain-filled Jambudweepa. Distressed by this, the gods, gandharvas, asuras, and serpents approached Lord Brahma with bewildered minds. Propitiating Brahma, they said: “O Venerable one, the entire earth is being excavated by Sagara’s sons. Many great beings in the lower worlds are being killed. The destroyer of our sacrifice has stolen our horse, and the sons of Sagara are slaying all living beings in their search.”</p>  <p>Thus ends the thirty-ninth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting Indra’s theft of the sacrificial horse and the heroic search of King Sagara’s sons across the earth.</p>",
        "**<u>The Fortieth Sarga of Bala Kanda: Kapila Curses the Sons of Sagara</u>** <p>Having heard the words of the gods, Brahma, the grandsire, replied to the devatas, who were extremely frightened and deprived of their senses by the events unfolding: “This entire earth belongs to the sagacious Vasudeva, who always supports it assuming the form of Kapila. The sons of Sagara will be burnt by the fire of his wrath. The excavation of the earth and the destruction of the short-lived sons of Sagara has been predestined since eternity.”</p>  <p>Hearing Brahma’s words, the thirty-three gods, exceedingly delighted, returned to their realms. Meanwhile, Sagara’s noble sons continued excavating the earth. Their activities produced dreadful sounds like thunder, and all beings—gods, demons, rakshasas, pisachas, and serpents—were killed as the earth was churned. Having circumambulated the earth, they approached their father Sagara and reported: “We have searched the entire earth, mighty and formidable as it is, yet we cannot find the horse or its thief. What shall we do? Kindly advise us.”</p>  <p>Incensed by their words, King Sagara commanded them again: “Excavate the earth once more. Capture the thief who stole the horse, accomplish your mission, and return safely.” Hearing this command, the sixty thousand sons of Sagara set off, digging towards the nether world (Rasatala) with great speed and strength.</p>  <p>While digging, they encountered mighty elephants of the quarters supporting the earth: Virupaksha in the south, Mahapadma in the east, Saumanasa in the west, and Bhadra in the north. They respectfully circumambulated these elephants and then continued their excavation.</p>  <p>Finally, in the northeastern region, they beheld Sage Kapila, the eternal form of Vasudeva, grazing near the sacrificial horse. Overjoyed, they rushed at him in wrath, armed with spades, ploughshares, and trees, shouting, “O wicked one! You have stolen our sacrificial horse. Know that we are the sons of Sagara!”</p>  <p>Kapila, overwhelmed with immense wrath at their audacity, uttered a loud “H'm” sound. By his immeasurable power, all the sons of Sagara were instantly reduced to ashes.</p>  <p>Thus ends the fortieth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting Sage Kapila’s curse and the destruction of the sons of Sagara.</p>",
        "**<u>The Forty-First Sarga of Bala Kanda: Anshuman’s Quest and the Sanctification of the Princes</u>** <p>After the sacrificial horse was stolen, King Sagara, realizing that his sons had been missing for a long time, summoned his grandson Anshuman. Resplendent with his own radiance, the king praised Anshuman for his valor, knowledge, and likeness to his illustrious ancestors. He urged the young prince to pursue the path of his uncles and recover the horse, while being prepared to confront mighty creatures and obstacles that lay in his way.</p>  <p>Carrying a bow and scimitar, Anshuman set out swiftly, following the trail of his uncles into the depths of the earth. Along the way, he beheld a mighty elephant, revered by various supernatural beings, and inquired respectfully about the whereabouts of his father’s brothers and the thief who had taken the sacrificial horse. The elephant assured him that, having accomplished his task, he would soon return with the horse.</p>  <p>Guided by the words of the elephant, Anshuman continued to seek information from the other guardians of the quarters, all of whom, proficient in knowledge and skill, honored him and confirmed that he would succeed in his mission. With determination, he reached the place where his uncles, the sons of Sagara, had been reduced to ashes. Overcome with grief, he bewailed their destruction and searched for water to perform the traditional rites, but found none.</p>  <p>With keen vision, Anshuman then observed Suparna, the eagle-like maternal uncle of his uncles, endowed with the swiftness of the wind. The mighty Garuda comforted the grieving prince, explaining that the destruction of the princes was part of the divine plan for the welfare of the three worlds. He instructed Anshuman to perform the rites with water from the celestial river Ganga, the eldest daughter of Himavat, who would sanctify the ashes and carry the sixty thousand princes to heaven.</p>  <p>Obeying these instructions, Anshuman swiftly took the horse and returned to his grandfather. He faithfully reported all that had transpired and conveyed the words of Suparna. King Sagara, though initially stunned by the account, performed the sacrifice according to the rules of the scriptures. Having completed the sacrificial rites, the mighty king returned to his capital but could not bring Ganga down to the earth. Without resolving this matter, he ruled his kingdom for thirty thousand years before ascending to heaven.</p>  <p>Thus ends the forty-first sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting Anshuman’s valorous quest, the sanctification of the princes, and King Sagara’s final years.</p>",
        "**<u>The Forty-Second Sarga of Bala Kanda: Bhagiratha’s Penance and the Divine Counsel for Ganga’s Descent</u>** <p>After the passing of King Sagara, the subjects installed the highly virtuous Anshuman as king. He ruled wisely and was greatly celebrated. Anshuman’s son, Dilipa, was born, and having vested the kingdom in him, Anshuman retired to perform rigorous penance on the sacred peak of Himavat. He spent thirty-two thousand years in the tapovana, turning into an ascetic, yet he did not achieve the objective of bringing down the celestial river.</p>  <p>King Dilipa, hearing of his forefathers’ plight, was deeply grieved. He constantly pondered how to bring Ganga to the earth and perform the funeral rites for his ancestors. Reflecting righteously on this matter, he was blessed with a son named Bhagiratha, who was highly virtuous and deeply desirous of fulfilling the task of liberating his ancestors.</p>  <p>Bhagiratha, the illustrious rajarshi, entrusted his kingdom to his ministers and went to the sacred place of Gokarna. There he performed long and rigorous penance, standing with arms uplifted, surrounded by fires, taking food only once a month, and maintaining strict control over his senses for many years. Pleased with Bhagiratha’s austerities, Lord Brahma, the lord of all beings, appeared before him and offered to grant a boon.</p>  <p>Humbly, Bhagiratha requested that the waters of Ganga may descend to the earth and sanctify the ashes of his grandfather’s sons, ultimately taking them to heaven. He also sought the boon that the lineage of the Ikshvakus be perpetuated and never terminated. Brahma, pleased with the righteousness and devotion of Bhagiratha, assured him that his desires would be fulfilled.</p>  <p>However, Brahma instructed that only Lord Siva could bear the tremendous force of Ganga’s descent. The earth itself could not withstand it, and no other being could hold her. Understanding this, Bhagiratha was guided to invoke Lord Siva to receive Ganga upon her arrival.</p>  <p>Thus, the creator of the worlds, having conversed with Bhagiratha and Ganga, ascended to heaven accompanied by the devatas and the Maruts, leaving the prince prepared to undertake the next stage of his sacred task.</p>  <p>Thus ends the forty-second sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting Bhagiratha’s rigorous penance and the divine counsel on bringing Ganga to the earth.</p>",
        "**<u>The Forty-Third Sarga of Bala Kanda: Bhagiratha Brings Ganga to Earth</u>** <p>After completing his intense penance for a full year, the mighty king Bhagiratha earnestly prayed to Lord Shiva, seeking the descent of the celestial river Ganga to Earth to cleanse the ashes of his ancestors. Pleased with Bhagiratha’s devotion, Shiva agreed to hold Ganga on his head, reducing the force of her mighty fall from the heavens.</p>  <p>The eldest daughter of Himavat, Ganga, descended from the sky in a mighty form, flowing with tremendous speed. Realizing the potential to flood the Earth, she tried to rush downward, but the clever three-eyed Lord restrained her in the matted locks of his hair. For many years, she wandered trapped there, until finally, satisfied with Bhagiratha’s unwavering penance, Shiva released her drop by drop, forming the sacred Bindusara lake. From this, seven streams of Ganga—Hladini, Pavani, Nalini, Suchakshu, Sita, Sindhu, and a seventh—flowed eastwards and westwards, bringing prosperity and purity to all.</p>  <p>The celestial and terrestrial beings—devatas, rishis, gandharvas, yakshas, apsaras, and aquatic creatures—witnessed the wondrous descent in amazement. The sky sparkled as if illuminated by a hundred suns, and the rivers roared with majestic energy, flowing wide, narrow, rapid, and slow in turns, cleansing everything in their path. Those who had fallen from heaven due to curses bathed in her waters and were absolved of all sins. People too rejoiced at the sight and took sacred dips in the holy river.</p>  <p>As Bhagiratha followed Ganga in his divine chariot, the river, renowned for destroying all sins, reached the ocean and descended into the netherworld. There, the holy waters purified the ashes of Bhagiratha’s ancestors, and their souls, freed from sin, ascended to heaven. Thus, the mighty king’s devotion and perseverance brought salvation to his forefathers, and Ganga earned her revered place as the river of purification.</p>  <p>Thus ends the forty-third sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting Bhagiratha’s devotion and the miraculous descent of the sacred river Ganga to Earth.</p>",
        "**<u>The Forty-Fourth Sarga of Bala Kanda: Bhagiratha Brings Ganga to Earth</u>** <p>King Bhagiratha, having long labored to fulfill the promise to his ancestors, followed the sacred river Ganga to the ocean and entered the lower realms of the earth, where the sons of Sagara lay reduced to ashes. His devotion and perseverance had not gone unnoticed, for when Ganga’s waters touched the ashes, Brahma, the lord of the universe, appeared before the king to proclaim the liberation of Sagara’s sixty thousand sons, who ascended to heaven like the devatas.</p>  <p>Brahma declared that as long as the ocean’s waters endure, Sagara’s sons would reside in heaven. He further announced that the river Ganga would henceforth be called Bhagirathi, after the king, and also Tripathaga, for she flows through the three worlds, purifying all she touches. Bhagiratha was instructed to perform sacred water rites for all his ancestors, thereby fulfilling his vow.</p>  <p>Though many illustrious ancestors, including Sagara and Anshuman, had prayed to bring Ganga to earth, the task had been beyond their power. Now, through Bhagiratha’s unmatched devotion, the river had descended, securing him great fame and a virtuous place in dharma. Purified by the sacred waters, he returned to his city, fulfilled in all desires, ruling his kingdom with prosperity and bringing joy to his people.</p>  <p>The Grandsire of the worlds, Brahma, having blessed Bhagiratha, returned to his own abode. Thus, the tale of Ganga’s descent was completed, teaching that those who hear or recite this sacred story with devotion gain fame, longevity, prosperity, and the favor of gods and ancestors. The auspiciousness of the Ganga’s descent ensures the destruction of sins and the fulfillment of righteous desires for all who revere it.</p>  <p>Thus ends the forty-fourth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting King Bhagiratha’s devotion, the liberation of Sagara’s sons, and the sacred descent of the Ganga to earth.</p>",
        "**<u>The Forty-Fifth Sarga of Bala Kanda: The Churning of the Ocean and the Battle for Nectar</u>** <p>Rama and Lakshmana, having listened to the wondrous narration of Viswamitra, were filled with astonishment and spent the night reflecting on the auspicious story. At daybreak, Rama approached the sage with folded hands, eager to hear more about the events of ancient times and the illustrious city of Vishala. Viswamitra, the great ascetic, then began recounting the legendary deeds of the gods and demons during the churning of the ocean of milk.</p>  <p>Long ago, the noble sons of Aditi and Diti, endowed with great strength and virtue, pondered on how to become free from old age, death, and disease. Inspired, they decided to churn the ocean of milk to obtain the nectar of immortality. They chose the mighty Mandara mountain as the churning rod and the serpent Vasuki as the rope. As the churning began, a dreadful poison, Halahala, emerged, burning the world with its fiery venom. Terrified, the gods sought refuge in Lord Shiva, who, at the command of Vishnu, drank the poison and saved the universe.</p>  <p>With the danger averted, the devatas and daityas continued churning. At Vishnu’s behest, he assumed the form of a tortoise to support the mountain, preventing it from sinking into the ocean. As the churning progressed, many wondrous things emerged: the celestial physician Dhanvantari, carrying the pot of nectar; the beautiful apsaras, the daughters of the churning; the divine horse Ucchaishravas; the precious Kaustubha jewel; and finally, the sacred nectar itself.</p>  <p>Among the celestial gifts, the goddess Varuni, daughter of Varuna, appeared seeking a consort. The sons of Aditi, the devatas, accepted her, while the sons of Diti, the daityas, did not. This marked the division between devas and asuras. A fierce and terrible battle then erupted between the devatas and daityas over the possession of the nectar. When the situation became dire, Vishnu, endowed with supreme power, assumed the enchanting form of Mohini and swiftly seized the nectar, leaving the daityas defeated and grounding those who opposed him.</p>  <p>Ultimately, the sons of Aditi triumphed over the sons of Diti. Indra, the king of gods, having slain the daityas, gained the kingdom and ruled joyfully over the worlds, accompanied by the rishis and celestial singers.</p>  <p>Thus ends the forty-fifth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the churning of the ocean, the emergence of divine treasures, and the glorious battle for the nectar of immortality.</p>",
        "**<u>The Forty-Sixth Sarga of Bala Kanda: Diti’s Austerities and the Severing of the Embryo</u>** <p>Diti, overwhelmed with grief at the death of her sons at the hands of the devatas, approached her husband Kasyapa with a plea. She requested a mighty son capable of slaying Indra and vowed to undertake severe austerities to achieve this. Kasyapa, moved by her devotion, assured her that if she remained pure and continued her penance for a thousand years, she would give birth to a son who would be the lord of the three worlds and a slayer of Indra.</p>  <p>Exceedingly pleased, Diti proceeded to the sacred spot Kushaplavana and engaged in intense mortifications. During her penance, Indra, the thousand-eyed king of gods, served her diligently, offering fire, Kusha grass, sticks, water, fruits, roots, and attending to her physical comfort to alleviate her fatigue. Diti, gratified by his service, expressed her joy and gratitude.</p>  <p>Ten years before the completion of her thousand-year penance, Diti, overcome by sleep, lay in an inauspicious posture with her feet towards her head. Seizing the opportunity, Indra entered her womb and, using his Vajra, severed the embryo into seven parts. Though the embryo cried out, Indra, highly powerful, continued his act. Diti, distressed, pleaded that it should not be killed, and respecting her words, Indra withdrew from the womb, seeking her forgiveness for having acted in a manner that prevented the birth of a slayer of devas.</p>  <p>Thus ends the forty-sixth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting Diti’s penance, Indra’s service and intervention, and the severing of the embryo destined to challenge the gods.</p>",
        "**<u>The Forty-Seventh Sarga of Bala Kanda: The Birth of the Maruts, Vishala’s City, and Sumati Honours Viswamitra</u>** <p>Deeply distressed by the severing of her embryo into seven pieces by Indra, Diti humbly addressed the unassailable god. She absolved him of any fault and requested that the seven fragments of her embryo be transformed into guardians of the wind, the Maruts. She desired that they assume celestial forms and preside over the skies, with some moving through Brahmaloka, Indraloka, and as Vayu in the universe, while the others would roam the four directions under Indra’s command.</p>  <p>Indra, the thousand-eyed slayer of Bala, on hearing her request, assured her that all would come to pass as she desired, and her sons would indeed wander as celestial beings. With this conclusion reached, Diti and her sons ascended to heaven from the tapovana, having fulfilled their purpose.</p>  <p>In the land once inhabited by Indra, Diti completed her austerities and received his devoted attention. In Alambusa, the highly virtuous and well-known son of the Ikshvaku dynasty, Vishala, was born. Vishala built a city named after himself. His lineage continued through mighty Hemachandra, followed by Suchandra, then Dhumraswa, Sanjaya, Sahadeva, Kusaswa, Somadatta, and finally Kakutstha. In the present time, Sumati, a heroic and invincible ruler comparable to the gods, resides in this city.</p>  <p>By the grace of the Ikshvaku lineage, all kings of Vishala have enjoyed long life, valor, and righteousness. Rama and his companions decided to stay here happily for the night, planning to visit King Janaka the following morning. Upon hearing of the arrival of the illustrious sage Viswamitra, the celebrated Sumati proceeded to receive him, offering supreme respects along with his spiritual preceptors and relatives. He inquired after the sage’s welfare and expressed his profound sense of blessing at being favored by his presence.</p>  <p>Thus ends the forty-seventh sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the birth of the Maruts, the establishment of Vishala’s city, and the reception of Viswamitra by King Sumati.</p>",
        "**<u>The Forty-Eighth Sarga of Bala Kanda: Viswamitra Relates the Curse of Gautama on Ahalya</u>** <p>After receiving the gracious hospitality of King Sumati, Viswamitra, Rama, and Lakshmana set out for Mithila. Curious about the youths they encountered on the way, Rama inquired of Viswamitra about their identity. The sage described them as heroic and celestial-like, armed with bows and scimitars, moving with the gait of lions and elephants, youthful and radiant like the Ashvin twins, and adorning the land like the Sun and Moon. Rama wished to know their purpose and lineage. Viswamitra then recounted their stay at Siddhashrama and the slaying of the rakshasas.</p>  <p>Delighted by Viswamitra’s narration, King Sumati extended traditional hospitality to Rama and Lakshmana, the sons of Dasaratha. After a night’s stay, they proceeded toward Mithila. The ascetics they encountered admired the auspicious city of Janaka and worshipped it, while Rama, seeing an old, deserted, and beautiful hermitage near Mithila, inquired about its history.</p>  <p>Viswamitra then narrated the story of Gautama’s hermitage and the curse on Ahalya. The illustrious prince Gautama, in the company of Ahalya, had performed austerities for many years. Taking advantage of an opportunity, Indra, consort of Sachi, disguised himself as the sage and approached Ahalya. Deceived, she consented to union with him. However, the sage Gautama, enraged by this transgression, cursed Indra, causing his testicles to fall to the earth, and cursed Ahalya to remain invisible, subsisting on air and lying in ashes, performing penance in the hermitage for thousands of years.</p>  <p>Gautama further declared that Ahalya would be purified when Rama, the unassailable son of Dasaratha, entered the forest. By serving Rama without greed or desire, she would regain her original form and live happily in his proximity. Having pronounced these curses and instructions, the powerful sage Gautama abandoned the hermitage at the peaks of the Himavat mountains, where he continued his austerities, attended by siddhas and charanas.</p>  <p>Thus ends the forty-eighth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the story of Gautama’s curse upon Ahalya and the foretelling of her eventual redemption through Rama.</p>",
        "**<u>The Forty-Ninth Sarga of Bala Kanda: Restoration of Indra and Liberation of Ahalya</u>** <p>After the curse of Gautama, Indra, deprived of his testicles and frightened, addressed the hosts of rishis, charanas, and devatas, confessing that his act of obstructing Gautama’s austerities had provoked the sage’s wrath. He acknowledged that he had lost his virility and that Ahalya had been deserted due to the sage’s curse. Indra requested the devatas and rishis to restore his potency for the benefit of the divine order.</p>  <p>Following Indra’s instructions, the devatas, led by Agni and accompanied by the Maruts, approached the pitrudevas. They took the testicles of a ram, offered in sacrificial rites, and grafted them onto Indra. From that time onward, the pitrudevas accepted rams without testicles in sacrifices, and Indra possessed the virility of a ram. Thus, the power of Gautama’s asceticism had its effect even on the gods.</p>  <p>Thereafter, Rama was instructed to enter Gautama’s hermitage to liberate Ahalya. Following Viswamitra’s guidance, Rama and Lakshmana entered the hermitage, with Viswamitra preceding them. They beheld Ahalya, radiant and shining with the power of her penance, previously invisible even to men, devas, and asuras. With the expiry of her curse, Rama touched her feet, and she became perceptible. Recalling Gautama’s words, Ahalya offered water for washing their feet, respectful offerings, and hospitality, which Rama accepted according to tradition.</p>  <p>The liberation of Ahalya was celebrated with celestial flowers, divine music, and dances of gandharvas and apsarasas. The devatas worshipped her, acknowledging the purity of her body restored by Gautama’s penance. Gautama himself, joyful along with Ahalya, worshipped Rama according to tradition and resumed his austerities. Having received due hospitality from Gautama, Rama set out for Mithila.</p>  <p>Thus ends the forty-ninth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the restoration of Indra’s virility, the liberation of Ahalya, and the hospitality extended to Rama by Gautama and Ahalya.</p>",
        "**<u>The Fiftieth Sarga of Bala Kanda: Arrival of Rama in Janaka’s Court</u>** <p>Rama, accompanied by Lakshmana and with Viswamitra leading, proceeded northeast and reached King Janaka’s sacrificial ground. Rama praised the extensive preparations of the illustrious king Janaka. Observing the assembly, he noted thousands of Brahmins from various regions studying the Vedas and the shelters of ascetics thronged with hundreds of carts, and suggested a suitable peaceful place near water for their encampment. Viswamitra chose such a place for Rama and Lakshmana.</p>  <p>Upon hearing of Viswamitra’s arrival, King Janaka advanced with his family priest Satananda to welcome him with humility and due respect. The officiating priests quickly brought offerings and paid homage with prayers. Viswamitra received Janaka’s respect and enquired about the welfare of the king, the sacrifice, and the assembled sages, who were then joined by all in delight. Janaka invited the foremost ascetic Viswamitra to be seated along with eminent sages, priests, and counselors, and the seating was arranged according to rank. The king expressed that the devatas had rendered his sacrifice fruitful and that he was blessed by Viswamitra’s presence.</p>  <p>Janaka, admiring the two youths—Rama and Lakshmana—asked Viswamitra about them. Noting their celestial prowess, heroic strength, lotus-like eyes, youth, and weapons, he inquired whose sons they were and for what purpose they had arrived. Viswamitra presented the youths as the illustrious sons of Dasaratha. He further recounted to Janaka their undaunted journey to Siddhashrama, the slaying of rakshasas, the sight of the city Vishala, the meeting with Gautama and Ahalya, and their purpose related to the great bow of Shiva that brought them to Mithila.</p>  <p>Thus ends the fiftieth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, detailing the arrival of Rama in Janaka’s court, his introduction by Viswamitra, and the king’s admiration of the princes and their deeds.</p>",
        "**<u>The Fifty-First Sarga of Bala Kanda: Satananda Describes Viswamitra’s Deeds to Rama</u>** <p>Satananda, the eldest son of sage Gautama, thrilled at seeing Rama, first praised Viswamitra’s intellect and great austerities. Observing the two princes comfortably seated, he inquired whether his renowned mother had been shown to Rama, whether she had offered homage with forest offerings, whether the old story of divine misdeeds had been told, and whether his father had been respectfully welcomed by Rama. Satananda sought to know all details of Rama’s reception of his parents.</p>  <p>Viswamitra, learned in words and eloquent, reassured Satananda that all that needed to be done had been done: Ahalya had been reunited with her husband Gautama properly. Hearing this, Satananda addressed Rama, welcoming him as fortunate to have arrived with the invincible sage Viswamitra. He extolled Viswamitra’s deeds, noting that by his austerities he became a Brahmarshi of unparalleled radiance and the supreme refuge, and that no one on earth was more fortunate than Rama, protected by such a great ascetic.</p>  <p>Satananda then recounted Viswamitra’s genealogy: he descended from Kusa, the son of Prajapati, through Kusanabha and Gadhi. Viswamitra, highly lustrous and mighty, had ruled the earth for many thousands of years. Once, he had paraded his army of the magnitude of an Akshauhini around the earth. As he wandered through kingdoms, cities, rivers, mountains, and hermitages, he reached Vasishta’s ashram. The hermitage was adorned with diverse trees, animals, siddhas, charanas, devatas, danavas, gandharvas, kinnaras, birds, and resting deer, inhabited by sages devoted to austerities, self-restraint, sense control, and prayer, including those subsisting on air, water, fallen leaves, or fruits and roots, as well as valakhilyas and vaikhanasas.</p>  <p>Viswamitra, highly powerful and foremost among conquerors, saw Vasishta’s hermitage, which appeared as magnificent as Brahmaloka itself.</p>  <p>Thus ends the fifty-first sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, detailing Satananda’s description of Viswamitra’s efforts, achievements, and journey to Vasishta’s ashram.</p>",
        "**<u>The Fifty-Second Sarga of Bala Kanda: Vasishta Prepares Hospitality for King Viswamitra</u>** <p>Mighty and heroic Viswamitra, overwhelmed with joy at seeing Vasishta, offered respectful salutations to the greatest among ascetics. Vasishta welcomed him warmly, ordered a seat, and offered fruits and roots in accordance with tradition. Viswamitra, having received this hospitality, inquired about the welfare of Vasishta, his austerities, fires, disciples, and the trees of his hermitage, and Vasishta responded regarding all of them.</p>  <p>Vasishta, the son of Brahma and greatest among those performing prayers, then inquired courteously about Viswamitra’s well-being, his administration of his kingdom, the welfare of his subjects, his servants, his army, treasury, friends, and descendants. The highly brilliant king Viswamitra, humbly addressed Vasishta, confirming that all was well. Both virtuous and magnanimous personalities exchanged delightful conversations and anecdotes, enjoying each other’s company.</p>  <p>At the conclusion, Vasishta expressed his desire to offer proper hospitality to Viswamitra and his incomparable army, requesting him to accept it. Viswamitra graciously replied that Vasishta’s kind words themselves constituted hospitality, and he acknowledged the honor already shown with fruits, roots, water for washing and sipping, and darshan.</p>  <p>Pleased, Vasishta called upon the speckled cow, Kamadhenu, to create and provide all necessary arrangements for honoring Viswamitra and his army. He commanded her to produce foods of six tastes in forms to be drunk, eaten, licked, and sipped, fulfilling all desires promptly and abundantly.</p>  <p>Thus ends the fifty-second sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, detailing Vasishta’s preparation for the distinguished hospitality of king Viswamitra and his retinue.</p>",
        "**<u>The Fifty-Third Sarga of Bala Kanda: Vasishta Declines to Give Kamadhenu to Viswamitra</u>** <p>Vasishta, through the wish-fulfilling cow Sabala, arranged for all desires of Viswamitra’s army to be satisfied. An abundance of sugarcane, honey, fried grains, excellent drinks, and food of all six tastes in massive quantities were served. The army, along with ladies, priests, and brahmins, were fully content and delighted. Viswamitra, honored with this hospitality, expressed his gratitude and requested Vasishta to give him Sabala, offering immense wealth, cows, elephants, chariots, horses, gold, and jewels in exchange.</p>  <p>Vasishta, the sagacious and virtuous ascetic, firmly declined the king’s repeated offers. He explained that Sabala was indispensable to him for performing oblations, sacrifices, and all sacred rites, and that she was his most cherished possession—his jewel, wealth, all-encompassing source of livelihood, and life itself. For these reasons, Sabala could not be given away, and no offer, however great, could persuade him otherwise.</p>  <p>Thus ends the fifty-third sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, detailing the exemplary hospitality of Vasishta and his firm refusal to part with the wish-fulfilling cow Sabala to King Viswamitra.</p>",
        "**<u>The Fifty-Fourth Sarga of Bala Kanda: Viswamitra’s Army Destroyed by Kamadhenu</u>** <p>When sage Vasishta refused to part with the wish-fulfilling cow Sabala, Viswamitra attempted to seize her by force. Distressed and sorrowful, Sabala lamented her plight and, thinking of Vasishta, shook off the king’s attendants and ran swiftly to the feet of her master. Standing before Vasishta, she expressed her grief, asking why she was being taken away despite her devotion and innocence.</p>  <p>Vasishta reassured her that no harm had been done and that the king, being highly powerful, forcibly carried her away. Sabala, skilled in speech and endowed with immeasurable power, explained that the divine strength of a Brahmin surpasses that of a Kshatriya and that, with Vasishta’s command, she could annihilate the wicked. On Vasishta’s instruction, Sabala created an army of Paplavas from her lowing, which swiftly destroyed Viswamitra’s forces.</p>  <p>Seeing his army crushed, the enraged king personally attacked and destroyed the Paplavas with weapons. In anger, Sabala created yet another force of Sakas and Yavanas, who covered the earth like golden filaments of valor. Clad in yellow apparel and armed with long swords and lances, they consumed the entire army of Viswamitra as if in fire. Even when Viswamitra unleashed his own weapons against them, the foes were scattered and tormented.</p>  <p>Thus ends the fifty-fourth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, depicting the invincible power of Kamadhenu and the destruction of Viswamitra’s army. </p>",
        "**<u>The Fifty-Fifth Sarga of Bala Kanda: Viswamitra’s Defeat and Acquisition of Divine Weapons</u>** <p>After witnessing Viswamitra’s weapons overpower his forces, sage Vasishta commanded Kamadhenu to create additional armies through her yogic power. From her lowing and other parts of her body, mighty warriors—Kambhojas, Paplavas, Yavanas, Sakas, Mlecchas, Kiratas, and Haritas—were born, armed with weapons and radiating brilliance. Instantly, they annihilated Viswamitra’s army of infantry, elephants, horses, and chariots.</p>  <p>Seeing his forces and one hundred sons destroyed, the furious Viswamitra charged at Vasishta, but the sage reduced them to ashes with a single 'humkara'. Overcome with shame and despondency like a wingless bird or an eclipsed Sun, Viswamitra entrusted one remaining son to rule his kingdom and retreated to the forest.</p>  <p>On the slopes of Himavat, Viswamitra performed austere penances to propitiate Lord Mahadeva. Pleased, Mahadeva appeared and granted him mastery over the Dhanurveda (science of archery) and the knowledge of all divine weapons known to gods, demons, sages, gandharvas, yakshas, and rakshasas. Empowered with these divine weapons, Viswamitra became immensely proud and mighty, and, in his arrogance, thought Vasishta slain.</p>  <p>Viswamitra released his weapons at Vasishta’s hermitage, burning down the ascetic forest. The saints, disciples, and animals fled in terror, leaving the hermitage deserted. Despite Vasishta’s repeated assurances that he would destroy Viswamitra like the Sun dispelling mist, the furious Viswamitra, brimming with anger, justified his attack, destroying the hermitage. Exceedingly enraged, Vasishta lifted his staff of death, prepared to punish the wicked king.</p>  <p>Thus ends the fifty-fifth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, depicting the initial defeat of Viswamitra, his austerities, and acquisition of divine powers. </p>",
        "**<u>The Fifty-Sixth Sarga of Bala Kanda: Vasishta’s Brahmadanda and Viswamitra’s Penance</u>** <p>Mighty Viswamitra discharged the Agneya weapon against Vasishta, shouting 'stay, stay'. In fury, Vasishta lifted his Brahmadanda, like a rod of death, and warned the Kshatriya son of Gadhi that he would destroy his pride and weapons. He declared the superiority of Brahma’s divine energy over the Kshatriya’s strength. Instantly, the Brahmadanda subdued and neutralized all of Viswamitra’s weapons, including Agneya, Varuna, Raudra, Aindra, Pasupata, Manava, Gandharva, Swapana, Vajra, Brahma, Kala, Painaka, Daita, Dharma and Vishnu Chakras, Vayavya, Mathana, Haya Sira, Kankala, Musala, Vaidyadhara, Trishula, Kapala, and Kankana.</p>  <p>Even the Brahmastra released by Gadhi’s son was swallowed by Vasishta with his Brahmadanda, causing flames and rays of smoke to emerge from his pores, terrifying the three worlds. The sages, uragas, gandharvas, and devatas praised Vasishta’s infallible energy and asked him to maintain it to deliver the worlds from distress.</p>  <p>Humbled and controlled by Vasishta, Viswamitra realized the futility of mere Kshatriya might. He acknowledged that the true power lies in Brahma’s energy, as his weapons were destroyed by a single Brahmadanda. Enlightened, Viswamitra resolved with a calm and clear mind to undertake intense penance to acquire Brahminhood.</p>  <p>Thus ends the fifty-sixth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, narrating the supremacy of Vasishta’s Brahmadanda and Viswamitra’s resolve for penance.</p>",
        "**<u>The Fifty-Seventh Sarga of Bala Kanda: Trisanku Seeks Heaven and Approaches Vasishta’s Sons</u>** <p>Distressed by his disgrace and recalling his enmity with Vasishta, the great ascetic Viswamitra performed severe austerities in the southern direction, subsisting on fruits and roots with fully controlled senses. From his penance were born four sons: Havishyanda, Madhushyanda, Dridhanetra, and Maharatha. After a thousand years, Brahma, the grandsire of the worlds, appeared and acknowledged Viswamitra’s penance, declaring that he had won the worlds of the rajarshis and was now a rajarshi himself. Departing for Brahmaloka with the gods, Brahma left Viswamitra humbled, recognising that even the devatas and rishis acknowledged only his rajarshi status. Determined, Viswamitra undertook greater austerities.</p>  <p>At this time, a celebrated Ikshvaku king, Trisanku, truthful and self-restrained, resolved to ascend to heaven with his physical body through a sacrifice. He first approached Vasishta to obtain consent, but the great sage refused. Determined to achieve his aim, Trisanku then approached Vasishta’s sons, who were performing long penances and exceedingly effulgent. Bowing humbly and offering obeisance, he requested them to guide him in performing the sacrifice so that he might attain heaven in his bodily form. Recognizing that the spiritual preceptor is the supreme resort for salvation and the liberator of kings, Trisanku acknowledged Vasishta’s sons as akin to gods and sought their help, as all other paths were closed to him.</p>  <p>Thus ends the fifty-seventh sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, narrating Trisanku’s resolve and his appeal to Vasishta’s sons for achieving heaven in his own body.</p>",
        "**<u>The Fifty-Eighth Sarga of Bala Kanda: Trisanku Cursed and Seeks Viswamitra</u>** <p>King Trisanku approached the hundred sons of Vasishta seeking help to ascend to heaven with his physical body. Enraged, the sons refused, reminding him that bypassing a guru faithful to truth is impossible, and that the chief priest of all Ikshvaku kings cannot be dishonoured. They admonished the king to return to his capital, warning that only Vasishta could perform such sacrifices. Despite his pleas, the king was rejected. Seeing his defiance, the sons cursed him to become a Chandala.</p>  <p>That night, Trisanku was transformed into a Chandala: dark-complexioned, dishevelled, smeared with ashes, wearing cemetery wreaths and iron ornaments. His counsellors, citizens, and followers fled in fear. Alone, burning with grief day and night, he sought out the sage Viswamitra, rich in ascetic merit. On seeing Trisanku’s pitiable state, Viswamitra was moved with compassion and addressed him with kindness, inquiring about the curse and his purpose.</p>  <p>Trisanku, with folded hands, explained that he had been rejected by both his guru and his sons, and that despite performing a hundred sacrifices with the intention to ascend to heaven bodily, he had not attained the desired fruit. He asserted his truthfulness, his righteous rule, and devotion to dharma, lamenting that destiny had frustrated his efforts. Recognizing Viswamitra as capable of averting the reverses of fate, he sought the sage’s help alone, acknowledging that there was no other protector or refuge for him.</p>  <p>Thus ends the fifty-eighth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, narrating Trisanku’s curse, transformation, and appeal to Viswamitra for salvation.</p>",
        "**<u>The Fifty-Ninth Sarga of Bala Kanda: Viswamitra Prepares the Sacrifice and Curses the Sons of Vasishta and Mahodaya</u>** <p>Seeing King Trisanku in the form of a Chandala, Viswamitra, son of Kushika, spoke kindly to him, offering refuge and assuring him not to fear. He promised to invite all pious maharshis to assist Trisanku in performing the sacrifice, even with his cursed form, and declared that heaven was already within the king’s reach for seeking refuge with him.</p>  <p>Viswamitra then ordered his highly virtuous and learned sons to prepare for the sacrifice and summoned all disciples, priests, and learned men versed in the Vedas from all directions. He instructed that any disrespectful response to his command should be reported to him. Following his orders, the Vedic scholars and brahmins, except Mahodaya, arrived from all countries.</p>  <p>Viswamitra recounted to the assembly the harsh and angry words of the hundred sons of Vasishta. Questioning how gods and sages could partake in a sacrifice officiated by a Chandala, he expressed his fury. Declaring himself blameless and having practiced rigorous penance, he cursed the offending sons of Vasishta to be reborn as mushtikas (dog-flesh-eating, hideous beings) for seven hundred lifetimes, wandering the worlds. As for the wicked Mahodaya, who falsely blamed him, he would be reborn among the Nishadas, merciless and taking pleasure in killing others, doomed to a long wretched existence.</p>  <p>After delivering these curses in the assembly of sages, the powerful and ascetic Viswamitra fell silent, leaving his wrathful decree in effect.</p>  <p>Thus ends the fifty-ninth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, narrating Viswamitra’s preparation for the sacrifice and the punishment of those who opposed Trisanku.</p>",
        "**<u>The Sixtieth Sarga of Bala Kanda: Trisanku Ascends to Heaven; Viswamitra Creates Another Heaven</u>** <p>Having destroyed the sons of Vasishta including Mahodaya by his ascetic power, the brilliant Viswamitra addressed the sages. He explained that King Trisanku, born in the Ikshvaku line and virtuous, sought refuge to ascend to heaven with his physical body. Viswamitra instructed that the sacrifice be performed in a manner enabling Trisanku’s ascent, and all the rishis agreed to this.</p>  <p>Acting as the chief officiating priest, Viswamitra oversaw the performance of the sacrifice. The officiating priests, proficient in mantras, conducted all rites properly according to tradition. After a long time, Viswamitra invoked the gods to partake of the offerings. When the gods did not come, he, angered, lifted the sacrificial ladle and proclaimed that by his ascetic power, he would send Trisanku to heaven with his physical body, an impossible feat for others.</p>  <p>Trisanku ascended towards heaven in the presence of sages, but Indra, seeing him, rejected him because of the curse of his preceptor, telling him to fall back to earth. As Trisanku cried out for help, the enraged Viswamitra, with great spiritual might, stopped his fall and, in anger and determination, began creating a new heaven and even new stars in the southern direction. He threatened to create another Indra if necessary, demonstrating his immense power.</p>  <p>Struck with awe, all rishis, devas, and asuras acknowledged Viswamitra’s might. He declared that Trisanku, cursed by his guru, would nonetheless dwell eternally in this newly created heaven with his physical body, and the stars he created would endure as long as the worlds exist. Trisanku would shine brilliantly among them, as if immortal, fulfilling the king’s desire.</p>  <p>All devas and sages extolled Viswamitra for his righteousness and power. At the conclusion of the sacrifice, the gods and ascetics returned to their respective abodes, having witnessed the extraordinary ascent of Trisanku.</p>  <p>Thus ends the sixtieth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, narrating the ascent of Trisanku and the creation of a new heaven by Viswamitra.</p>",
        "**<u>The Sixty-First Sarga of Bala Kanda: Indra Steals the Sacrificial Horse; Sunassepha Offers Himself</u>** <p>After the sages departed, the great Viswamitra observed that obstructions in the southern region required attention. He suggested that the sages perform intense austerities in the peaceful forest near Lake Pushkara in the western region. There, Viswamitra practiced severe penance, living on fruits and roots.</p>  <p>At this time, King Ambarisha of Ayodhya prepared for a grand sacrifice. During the ritual, Indra stole the sacrificial horse, and the priest informed the king that the animal was missing and warned that failure to procure it could jeopardize the sacrifice and incur great consequences. Ambarisha, a wise and resourceful king, searched extensively across countries, villages, cities, forests, and sacred hermitages.</p>  <p>Eventually, he found sage Richika seated on Bhrigutunda Mountain with his wife and sons. Ambarisha respectfully bowed and inquired about a suitable sacrificial animal, offering a hundred thousand cows in exchange. The sage refused to give his eldest son, and his wife refused to part with the youngest. Observing this, their middle son, Sunassepha, volunteered himself, saying that if the eldest cannot be sold and the youngest spared, he should be offered instead.</p>  <p>King Ambarisha, delighted, accepted Sunassepha in exchange for a hundred thousand cows. Mounting the youth on his chariot, the brilliant and illustrious rajarshi Ambarisha proceeded with the sacrifice, immensely pleased with the arrangement.</p>  <p>Thus ends the sixty-first sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, narrating the theft of the sacrificial horse by Indra and the selfless offering of Sunassepha.</p>",
        "**<u>The Sixty-Second Sarga of Bala Kanda: Viswamitra Protects Sunassepha and Continues Austerities</u>** <p>After taking Sunassepha with him, King Ambarisha rested at Pushkara at noon. Sunassepha, distressed and exhausted, saw his maternal uncle Viswamitra performing austerities with other sages. Falling at the sage’s feet, he pleaded for protection, describing himself as an orphan without relatives, and asked the virtuous sage to safeguard him according to dharma, like a father protects his son.</p>  <p>Viswamitra consoled Sunassepha, explaining that the proper time had come for him to fulfill his role. He instructed his sons that protecting the boy was a righteous act, and the sacrifice of Ambarisha could proceed successfully if Sunassepha participated. Despite initial objections from his sons, Viswamitra, enraged at their audacious words, cursed them but ensured Sunassepha’s safety.</p>  <p>Sunassepha was then prepared for the sacrifice: bound to the Vaishnava post with sacred ropes, adorned with red garments and garlands, and instructed to chant two sacred mantras. Following this, he approached King Ambarisha, who, with the consent of the priests, treated him as the sacrificial animal and praised the gods. Indra, pleased by Sunassepha’s hymns, granted him long life.</p>  <p>The king obtained immense rewards from the sacrifice through the grace of Indra, while Viswamitra continued his mighty austerities at Pushkara for a thousand years.</p>  <p>Thus ends the sixty-second sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, narrating Viswamitra’s protection of Sunassepha and the continuation of his penances.</p>",
        "**<u>The Sixty-Third Sarga of Bala Kanda: Viswamitra Obtains the Title of Maharshi and Pursues the Rank of Brahmarshi</u>** <p>After a thousand years of penance, the gods approached the mighty ascetic Viswamitra, who had completed his ritual bath, intending to grant him the fruits of his austerities. Brahma, exceedingly effulgent, acknowledged that Viswamitra had become a Rishi through his self-earned sacred deeds and blessed him with prosperity. The gods then returned to heaven, while Viswamitra continued his rigorous austerities.</p>  <p>After a long lapse of time, Menaka, the chief celestial nymph, came to bathe at Pushkara. Viswamitra, under the influence of Cupid, was captivated by her incomparable beauty. He welcomed her to his hermitage and expressed his infatuation. Menaka lived in the hermitage for ten years, during which time Viswamitra enjoyed her company. However, as time passed, he became filled with grief, anxiety, and remorse, realizing that his great austerities had been interrupted by this hindrance.</p>  <p>Repenting, Viswamitra dismissed Menaka and proceeded to the northern mountains. There he took a vow of lifelong celibacy to control his senses and performed severe austerities along the banks of the Kausiki river. His rigorous penance for a thousand years, under five fires in summer, in open sky during the monsoon, and immersed in water in winter, caused fear even among the gods.</p>  <p>Eventually, after consultation among the gods and sages, Viswamitra, son of Kusika, was conferred the title of <i>Maharshi</i>. Brahma addressed him with sweet words, welcoming him and acknowledging his eminent rank among sages. Viswamitra humbly bowed but declared that he had conquered his senses. Brahma advised him that he had not yet fully mastered them and must continue striving. After the departure of the gods, Viswamitra continued austerities, raising his arms in the air, subsisting on air alone, and persisting through severe conditions for a thousand years, which greatly perturbed the gods and Indra. Celestial nymphs like Rambha were sent to disturb him, testing his resolve.</p>  <p>Thus ends the sixty-third sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i>, narrating Viswamitra’s attainment of the title Maharshi, the impediments created by Menaka, and his subsequent intense austerities to achieve the rank of Brahmarshi.</p>",
        "**<u>The Sixty-Fourth Sarga of Bala Kanda: Viswamitra Curses Rambha</u>** <p>Indra, the lord of gods, commanded the apsara Rambha to distract Viswamitra with beauty and passion, to hinder his austerities for the benefit of the gods. Bashful but obedient, Rambha expressed her fear of Viswamitra’s wrath, knowing he was a formidable ascetic.</p>  <p>Indra reassured her, promising to stay nearby as a cuckoo in the springtime, and ordered her to carry out the task of seduction. Rambha, displaying captivating beauty and enchanting gestures, approached Viswamitra to allure him. The sound of the cuckoo and the sight of Rambha made the ascetic suspicious, realizing it was the work of Indra.</p>  <p>Seized with anger, Viswamitra cursed Rambha: for attempting to seduce him and disturb his control over desire and anger, she would become a rock for ten thousand years. However, he also promised that, as an effulgent Brahmin endowed with the power of asceticism, he would eventually liberate her from this curse.</p>  <p>The great sage, unable to contain his anger and distressed at the loss of his ascetic merit, resolved not to lose his temper or speak for hundreds of years. He vowed to conquer his senses, abstain from food and breath for innumerable years, and continue austerities until he attained complete Brahminhood, ensuring that his body would not deteriorate during this penance.</p>  <p>Thus, the eminent ascetic Viswamitra took an unparalleled vow to perform rigorous penance for a thousand years, establishing his determination and steadfastness. </p>  <p>Thus ends the sixty-fourth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i>, narrating Viswamitra’s curse upon Rambha and his resolute vow of intense austerities.</p>",
        "**<u>The Sixty-Fifth Sarga of Bala Kanda: Viswamitra Attains Brahmarshi Status</u>** <p>After leaving the northern part of Himavat, the great ascetic Viswamitra reached the eastern quarter and performed extremely rigorous austerities. Observing a vow of silence for a thousand years, he became so steadfast and unshakable that anger could not enter his mind. After completing the vow, he began to partake food, and at that moment, Indra, disguised as a Brahmin, requested rice. Viswamitra, observing perfect discipline, gave all the rice without uttering a word, and then continued his penance for another thousand years, suspending breath and food, during which smoke arose from his head, alarming the three worlds.</p>  <p>The gods, gandharvas, uragas, and others were bewildered by the immense power of his austerities and dimmed in their own glory. They recognized that his penance was flawless, and if his desires were denied, he could destroy all the three worlds. To avert calamity, they approached Brahma and addressed Viswamitra with pleasing words, welcoming him as a Brahmarshi. They praised his intense austerities and declared that he had attained brahminhood, blessing him with long life and prosperity. Vasishta, the eminent sage, confirmed Viswamitra’s status as Brahmarshi, granting him the right to interpret the Vedas and perform sacrifices.</p>  <p>Virtuous Viswamitra, having attained this highest brahminhood, worshipped Vasishta and wandered over the earth with fixed ascetic resolve, embodying virtue, ascetic power, and the ultimate repository of tapas energy. King Janaka, present at the sacrifice along with Rama and Lakshmana, expressed his gratitude and reverence. He circumambulated the sage, and Viswamitra, honored by maharshis, returned to his abode along with Rama and Lakshmana.</p>  <p>Thus ends the sixty-fifth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i>, narrating how the great ascetic Viswamitra attained the exalted status of Brahmarshi.</p>",
        "**<u>The Sixty-Sixth Sarga of Bala Kanda: King Janaka, the Bow of Mahadeva, and the Marriage of Sita</u>** <p>At the break of dawn, King Janaka, having completed his daily rituals, welcomed the magnanimous sage Viswamitra along with the illustrious princes, Rama and Lakshmana. With due reverence in accordance with the scriptures, the virtuous king paid his respects and asked the sage how he could serve him, humbly offering to follow his guidance.</p>  <p>Addressing the heroic king, Viswamitra informed Janaka of the sons of Dasaratha, renowned throughout the world, who were eager to behold the great bow of Mahadeva kept in the king’s possession. Janaka graciously agreed and began recounting the history of the mighty bow.</p>  <p>He narrated how the bow, a weapon of extraordinary power, was once lifted by Lord Siva during the destruction of Daksha’s sacrifice. In his anger, Rudra had threatened the gods, and in order to protect them, the bow was eventually entrusted to the kingly lineage, reaching Janaka himself. Janaka then recounted the miraculous birth of his daughter Sita, who arose from the earth while he was ploughing the sacred field. She was not born of a womb but emerged fully formed, destined to be given in marriage only to the prince who could prove his unmatched prowess.</p>  <p>Many kings, drawn by her fame and desirous of winning her hand, came to Mithila to test their strength against the formidable bow. Yet none could even lift it, and their failed attempts left them humiliated and filled with anger, leading to a siege on the city. Observing their plight, Janaka performed penances and propitiated the gods, who granted him a mighty army. With this divine aid, the rebellious kings were vanquished and scattered.</p>  <p>Janaka then declared that the radiant bow would be shown to Rama and Lakshmana. He solemnly proclaimed that if Rama could lift and string the mighty weapon, he would give Sita, his daughter born of the earth, in marriage to the son of Dasaratha, fulfilling the conditions of her birth and the boon of her unparalleled prowess.</p>  <p>Thus ends the sixty-sixth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting King Janaka’s account of Mahadeva’s bow and the destined union of Sita with Rama.</p>",
        "**<u>The Sixty-Seventh Sarga of Bala Kanda: Rama Strings the Bow and King Dasaratha is Summoned</u>** <p>Having listened to King Janaka, the great ascetic Viswamitra instructed that the divine bow be presented to Rama. The king immediately ordered his ministers and feudatories to bring the magnificent bow, adorned with flowers and sandalwood, from its resting place. With the help of thousands of stalwart men, the eight-wheeled cart bearing the bow was brought to the king, and his counsellors, with reverence, placed it before Janaka and declared it ready to be shown to the princes.</p>  <p>Janaka explained the history of the bow to Viswamitra and the princes. He recounted how, in ancient times, powerful kings, sages, and even the hosts of devatas had failed to lift or string it. It was said that none of mortals, nor the mightiest of celestial beings, could wield this extraordinary weapon. The bow, unparalleled in strength and sanctity, was now being brought before Rama and Lakshmana to test their prowess.</p>  <p>Upon Viswamitra’s words, Rama respectfully opened the casket and beheld the glorious bow. He touched it, lifted it, and with supreme ease fixed the string and drew it. With a mighty twang, the bow broke into two, producing a sound like a clap of thunder and shaking the earth, leaving all present—except Janaka, Viswamitra, Rama, and Lakshmana—staggered in awe.</p>  <p>Overjoyed and deeply impressed, King Janaka acknowledged the marvellous prowess of Rama, the son of Dasaratha, declaring that by marrying him, his daughter Sita would bring unmatched glory to his dynasty. He confirmed that Sita, the reward of prowess, was most worthy to be given to Rama. With the king’s consent, ministers were promptly dispatched to Ayodhya to inform Dasaratha of the momentous event and bring him to Mithila.</p>  <p>Thus ends the sixty-seventh sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting Rama’s extraordinary feat in stringing the bow and the formal summons of King Dasaratha to Mithila for the marriage of Sita.</p>",
        "**<u>The Sixty-Eighth Sarga of Bala Kanda: King Dasaratha Arrives at Mithila</u>** <p>Following King Janaka’s command, his messengers, after traveling three nights with tired horses, reached the city of Ayodhya. They informed the doorkeepers of the royal palace and, with the king’s permission, entered and beheld the aged and godlike King Dasaratha. Reverently folding their hands, free from apprehension, they addressed the king in sweet and affectionate words.</p>  <p>The messengers conveyed Janaka’s greetings and expressed his repeated concern for the welfare of Dasaratha, his preceptors, priests, and attendants. They reminded the king of the vow Janaka had made long ago to give his daughter Sita as a reward of prowess, which, having been fulfilled by Rama, now made him eminently worthy of her hand. Janaka requested that Dasaratha, accompanied by his preceptors and priests, come swiftly to Mithila to witness this joyous occasion and to bless the union.</p>  <p>Hearing the message, King Dasaratha was exceedingly delighted. He informed his ministers, sages, and counselors that Rama, under the protection of Viswamitra, was safely in the country of Videha, having demonstrated his extraordinary prowess by breaking the mighty bow in the assembly. Dasaratha, pleased with the news and approving Janaka’s actions, resolved to depart for Mithila the following day without delay.</p>  <p>All the ministers and maharshis rejoiced and spent the night in honour and happiness, eagerly anticipating the royal journey to Mithila to witness the proposed marriage of Sita to Rama.</p>  <p>Thus ends the sixty-eighth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i>, composed by sage Vālmīki, recounting the arrival of King Dasaratha at Mithila in response to Janaka’s invitation.</p>",
        "**<u>The Sixty-Ninth Sarga of Bala Kanda: King Dasaratha Reaches Mithila and Is Honoured by Janaka</u>** <p>After the night had passed, King Dasaratha, accompanied by spiritual preceptors, relatives, and ministers, instructed that all officers of the treasury, carrying abundant wealth and precious gems, proceed ahead. He also ordered the four divisions of his army, with chariots and palanquins, to march without delay. Brahmins like Vasishta, Vamadeva, Jabali, Kasyapa, Markandeya, and Katyayana were sent ahead, and Dasaratha’s own chariot was prepared for immediate departure, as the messengers from Janaka were hastening him along.</p>  <p>Following the king’s command, the army moved in four divisions behind Dasaratha as he advanced with the sages. Covering the distance in four days, they reached Videha, where the fortunate King Janaka, having received news of their arrival, made arrangements to offer them reverential hospitality. Approaching the aged ruler Dasaratha, Janaka was filled with immense delight and joy.</p>  <p>Filled with happiness, Janaka welcomed Dasaratha warmly, expressing that he would experience the pleasure of seeing his sons’ heroic prowess rewarded. By divine grace, Vasishta and other foremost sages, along with the valiant Raghus, had arrived, ensuring all obstacles were overcome, and the Videha lineage was honoured. Janaka instructed that Dasaratha perform the marriage at dawn the next day, after the completion of the sacrifice, with the approval of the sages.</p>  <p>King Dasaratha, known for his righteousness and truthfulness, assured Janaka that he would act according to his words. Janaka, filled with admiration for the noble king, spent the night in the company of sages with great delight. Dasaratha, reunited with Rama and Lakshmana and honoured by Janaka, spent the night with supreme satisfaction. Mighty Janaka also performed sacrificial rites with both his daughters and spent the night there, preparing for the upcoming ceremonies.</p>  <p>Thus ends the sixty-ninth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i>, composed by sage Vālmīki, recounting Dasaratha’s arrival at Mithila and the warm reception by King Janaka.</p>",
        "**<u>The Seventieth Sarga of Bala Kanda: Janaka Summons His Brother and the Glory of the Ikshvaku Lineage</u>** <p>At dawn, after the sages had performed their morning rituals, the eloquent King Janaka spoke to his chief priest, Satananda. He expressed his desire to behold his younger brother, the illustrious Kusadhwaja, who was then ruling the sacred city of Sankasya, a realm as splendid as the aerial chariot Pushpaka and lying on the banks of the sacred river Ikshumati. Janaka wished that Kusadhwaja, protector of sacrificial rites, might share in his joy and accompany him.</p>  <p>Following the king’s instructions, a group of faithful messengers rode swiftly to Sankasya, where they informed Kusadhwaja of Janaka’s wish. The righteous and mighty Kusadhwaja immediately set out for Mithila. Upon arrival, he respectfully greeted Satananda and the virtuous King Janaka and took his seat, and together, the two heroic brothers dispatched Sudamana, the wisest of ministers, to fetch the invincible King Dasaratha of the Ikshvaku dynasty along with his sons and ministers.</p>  <p>Having heard the message, King Dasaratha, accompanied by his ministers and relations, traveled to Mithila, where he was warmly welcomed by Janaka and the assembled sages. There, the venerable sage Vasishta, permitted by Viswamitra, spoke in detail about the greatness of the Ikshvaku lineage. He traced the sacred genealogy from the unmanifest Brahma, through Marichi, Kasyapa, Vivasvan, Manu, and Ikshvaku, down through illustrious kings such as Kukshi, Anaranya, Pruthu, Trishanku, Mandhata, Sagara, Anshuman, Dilipa, Bhagiratha, Raghu, Kalmashapada, Sudarsana, Agnivarna, Sighraga, Maru, Prasusruka, Ambarisha, Nahusha, Yayati, Nabhaga, Aja, and finally to Dasaratha, the father of Rama and Lakshmana.</p>  <p>With this venerable account, Janaka, devoted to righteousness and ever mindful of dharma, humbly requested that Dasaratha graciously bestow his equally accomplished daughters as brides for the heroic and virtuous Rama and Lakshmana of the Ikshvaku lineage, ensuring the continuation of righteousness and valor in both dynasties.</p>  <p>Thus ends the seventieth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the summoning of Kusadhwaja, the detailed genealogy of the Ikshvaku dynasty, and the preparations for the divine marriages of Rama and Lakshmana.</p>",
        "**<u>The Seventy-First Sarga of Bala Kanda: The Marriage of Sita and Urmila</u>** <p>King Janaka, the noble ruler of Mithila, having been requested by Sage Vasishta to recount the history of his dynasty, spoke with folded hands and great humility. He declared that it is proper for one offering his daughter in marriage to relate the genealogy of his lineage in full, so that the sages may understand the noble heritage from which the bride hails.</p>  <p>He began by narrating the illustrious lineage of Mithila’s kings, starting with the great King Nimi, supremely virtuous and renowned across the three worlds for his deeds. From him were born successive generations of righteous and powerful rulers: Mithi, Udavasu, Nandivardhana, Suketu, Devarata, Brihadradha, Mahavira, Sudhruti, Drishtaketu, Haryasva, Maru, Pratindhaka, Kirtiratha, Devamidha, Vibudha, Mahidhraka, Kirtirata, Maharoma, Maharoma’s son Swarnaroma, and finally Hrasvaroma. Each king was praised for his virtue, courage, and devotion to dharma, ensuring the prosperity of their realm and the welfare of their subjects.</p>  <p>Hrasvaroma, in his wisdom, crowned his eldest son as king and entrusted his younger brother, Kusadhwaja, with the responsibilities of ruling, while he retired to the forest. After Hrasvaroma attained heaven, his sons continued to govern Mithila with righteousness and care. At a later time, King Sudhanva of Sankasya sought to seize Mithila and demanded Sita, Janaka’s daughter, along with the divine bow of Shiva. Refusing to yield to his unjust demand, a great battle ensued, in which Sudhanva was slain and Kusadhwaja was installed as the ruler of Sankasya.</p>  <p>With the kingdom secure, Janaka, delighted and full of joy, presented his daughters in marriage: Sita, the lotus-eyed maiden, to Rama, and Urmila, equally virtuous, to Lakshmana. He declared that these gifts were offered with utmost pleasure, three times over, leaving no doubt of his intent. He advised King Dasaratha to perform the appropriate rites, including the giving of cows for forefathers’ honor, and to solemnize the marriage on the third day from today, under the Uttara-Phalguni star, so that Rama and Lakshmana might enjoy felicity and prosperity.</p>  <p>Thus concludes the seventy-first sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the noble lineage of Mithila’s kings and the joyous bestowal of Sita and Urmila in marriage to Rama and Lakshmana.</p>",
        "**<u>The Seventy-Second Sarga of Bala Kanda: Preparations for the Marriages of Dasaratha’s Sons</u>** <p>Having heard King Janaka recount the illustrious genealogy of Mithila, the mighty sage Viswamitra, accompanied by Vasishta, addressed the king with reverence. He praised the glory of the two noble races—the Ikshvakus and the Videhas—remarking that no lineage in the three worlds could match their virtue and renown. He further declared that the proposed marriages between Rama and Sita, and Lakshmana and Urmila, were perfectly matched in piety, beauty, and righteousness. Likewise, the daughters of King Kusadhwaja were equally fitting for Bharata and Satrughna, ensuring that all four marriages would be auspicious and harmonious.</p>  <p>Janaka, pleased with the counsel of the great ascetics, gave his consent for the unions. He acknowledged the merit of their advice and blessed the match, confirming that the daughters of Kusadhwaja—Srutakirti and Mandavi—would become the consorts of Bharata and Satrughna, and serve them faithfully. He entrusted the arrangements to the sages, ensuring that the alliances between the Ikshvaku and Videha dynasties would strengthen their noble heritage.</p>  <p>On the appointed day, under the guidance of the ascetics, the four princes of Ayodhya—Rama, Lakshmana, Bharata, and Satrughna—took the hands of the four princesses in marriage. The ceremony was performed at the auspicious hour with the blessings of all, under the Phalguni stars, so that prosperity and felicity would attend the unions. King Dasaratha, devoted and affectionate towards his sons, performed the requisite rites, including the gifting of hundreds of thousands of cows to brahmins, each cow adorned with golden horns, accompanied by calves, and with vessels for milking and other valuables. Through these acts of generosity, he ensured the welfare of his sons and the sanctity of the ceremonies.</p>  <p>Surrounded by his sons and the celebratory grandeur of the occasion, King Dasaratha shone with the majesty of Prajapati himself, blessed and pleased, his heart filled with joy and devotion. The marriages having been solemnized, the dynastic alliances were firmly established, bringing happiness and prosperity to both the houses of Ayodhya and Mithila.</p>  <p>Thus concludes the seventy-second sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the meticulous preparations and joyous celebration of the marriages of King Dasaratha’s four sons.</p>",
        "**<u>The Seventy-Third Sarga of Bala Kanda: The Auspicious Marriages of Rama and His Brothers</u>** <p>On the day King Dasaratha gave the finest cows in charity, the heroic Yudhajit, son of King Kekaya and maternal uncle of Bharata, arrived in Ayodhya. He greeted the king warmly, enquiring after his welfare, and conveyed that all those whose well-being the king cared for were hale and healthy. The Kekaya king, desiring to see his sister’s son, had sent him to witness the joyous occasion of the royal marriages.</p>  <p>King Dasaratha received his honoured guest with supreme respect. Having spent the night with his virtuous sons, he rose at dawn and performed his daily duties, following the rishis to the sacrificial arena. At the auspicious moment of Vijaya, Rama, adorned with all ornaments and accompanied by his brothers, approached his father with Vasishta and other venerable sages preceding them.</p>  <p>Vasishta, the adored and wise sage, approached King Janaka of Videha and announced that the sons of Dasaratha, having completed all the rites preparatory to marriage, were ready to receive the brides. Janaka, renowned for his generosity and righteousness, replied that all necessary preparations were complete. He invited the princes to the altar and instructed them to take their wives’ hands and perform the sacred ceremonies without delay.</p>  <p>The noble daughters—Sita, Urmila, Mandavi, and Srutakirti—adorned in jewels, were brought before Agni, the sacred fire, and the princes respectfully accepted them with the consent of Vasishta. Circumambulating the fire in accordance with the sacred rites, Rama and his brothers solemnized their marriages. As they held the elegant hands of their consorts, flowers rained from the skies, celestial kettledrums resounded, apsaras danced gracefully, and gandharvas sang melodiously, creating a scene of divine splendor.</p>  <p>Having tied the nuptial knot after three circumambulations of the fire, the sons of Raghu departed to their tents with their wives. King Dasaratha, accompanied by sages and relatives, observed and blessed the happy families. Thus, the auspicious marriages of Rama, Lakshmana, Bharata, and Satrughna were solemnized with divine joy and grandeur.</p>  <p>Thus ends the seventy-third sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i> composed by sage Vālmīki, recounting the joyous unions of the sons of Dasaratha with the princesses of Videha.</p>",
        "**<u>The Seventy-Fourth Sarga of Bala Kanda: Viswamitra’s Departure, Gifts of Janaka, and the Encounter with Parasurama</u>** <p>After night had passed, the great sage Viswamitra, having profusely blessed the princes born in the race of Raghu, took leave of King Janaka and King Dasaratha and set out towards the northern Himalayas. With the departure of Viswamitra, King Dasaratha, the source of joy to his people, took leave of Janaka, lord of Mithila, and swiftly returned to his city of Ayodhya.</p>  <p>On his journey, King Janaka generously bestowed a vast array of gifts upon his daughters. He gave them a hundred thousand cows, excellent woollen carpets, crores of silk garments, elephants, horses, chariots, infantry, exquisitely decorated servants, and ornaments of gold, pearls, and corals. Having ensured the consent of King Dasaratha, Janaka returned to his palace in Mithila.</p>  <p>King Dasaratha, accompanied by his illustrious sons and preceded by sages, journeyed back to Ayodhya. Along the way, he observed frightening cries from birds and auspicious movements of deer, which left him anxious and troubled. Noticing his concern, the great sage Vasishta explained that the ominous signs of birds foretold a celestial event, while the deers’ behavior indicated peace would soon be restored, thus reassuring the king.</p>  <p>Suddenly, a fierce storm arose, shaking the earth and toppling trees. Darkness covered the sky and the army, yet King Dasaratha and the sages maintained their composure while all others lost consciousness. In this dreadful atmosphere, they beheld the mighty warrior Parasurama, son of Jamadagni, with a terrible crown of matted hair, a bow in hand that flashed like lightning, a principal arrow resembling Shiva at the time of Tripura’s destruction, and an axe on his shoulder. His blazing form appeared unendurable and fearsome to ordinary people.</p>  <p>The sages, engaged in chanting mantras and offering oblations, whispered among themselves in apprehension over the wrath of the son of Bhargava. They wondered if, enraged at his father’s slaughter, he might again seek to annihilate the Kshatriyas. Offering homage to the mighty Parasurama, they addressed him with gentle words, 'O Rama, O Rama.' Valorous Parasurama accepted their respects and, in turn, spoke to Rama, son of Dasaratha, marking a significant moment in their destined encounter.</p>  <p>Thus ends the seventy-fourth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i>, recounting Viswamitra’s departure, the generous gifts of King Janaka, and the awe-inspiring encounter of King Dasaratha’s party with Parasurama.</p>",
        "**<u>The Seventy-Fifth Sarga of Bala Kanda: Parasurama Challenges Rama to String the Bow of Vishnu</u>** <p>Having heard of Rama’s extraordinary prowess in breaking the mighty bow of Siva, the valiant son of Jamadagni, Parasurama, arrived with another formidable bow, challenging Rama to display his strength. He presented the bow obtained through Jamadagni and declared that Rama might fix an arrow and demonstrate his valor, offering to engage him in a duel if he succeeded.</p>  <p>King Dasaratha, distressed at this bold display, humbly pleaded with Parasurama to give assurance of safety to his young sons, invoking his renown as a Brahmana, learned in the Vedas and devoted to righteousness. Parasurama, disregarding the king’s entreaties, addressed Rama directly, pointing out the two excellent celestial bows well known throughout the worlds—one broken by Rama, originally granted to Shiva by the gods to slay the demon Tripura, and the other, an unassailable bow of Vishnu, radiant and equal in power to the bow of Siva.</p>  <p>The gods, wishing to gauge the strength of both bows, consulted Grandsire Brahma, whose guidance sparked a conflict between Siva and Vishnu. A fearsome clash ensued, each seeking to assert supremacy, shaking all who witnessed it. With the prowess of Visnu, Siva’s bow was stretched and rendered motionless, causing the sages and gods to acknowledge Visnu’s superiority.</p>  <p>Glorious Siva, enraged, entrusted the bow and arrow to Rajarshi Devarata in Videha. Parasurama recounted his own deeds: slaying Kartaveeryarjuna, decimating the Kshatriya race repeatedly, and conquering the earth before conferring it to the great sage Kasyapa. Gifted with ascetic power, he had now made the Mahendra mountain his abode. Hearing of Rama’s feat in breaking Siva’s bow, Parasurama had come swiftly with the bow of Vishnu, instructing Rama to respect the duties of a Kshatriya and take hold of this eminent weapon, capable of conquering hostile cities, and offered to engage him in combat if he succeeded.</p>  <p>Thus ends the seventy-fifth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i>, recounting the formidable challenge of Parasurama and the presentation of the mighty bow of Vishnu to Rama.</p>",
        "**<u>The Seventy-Sixth Sarga of Bala Kanda: Rama Bends the Bow of Vishnu—Parasurama Returns to Mahendra Mountain</u>** <p>Having arrived with the mighty bow of Vishnu, Parasurama was intercepted by Rama, the son of Dasaratha, who respectfully acknowledged the Brahmana’s deeds and commended him for fulfilling his duties. Yet, Rama asserted that he was fully capable of demonstrating his Kshatriya prowess and valour, challenging Parasurama’s underestimation of him.</p>  <p>Enraged, Rama swiftly seized the bow and arrow, bent the mighty weapon, and fixed the arrow. He addressed Parasurama with honor, acknowledging his status as a Brahmana and relation to Visvamitra, and declared that he could not release the arrow to take his life. Rama warned that he could, however, destroy the mobility of Parasurama or even the worlds achieved through his ascetic energy, asking the Brahmana to choose which he desired.</p>  <p>Parasurama, recognizing Rama’s incomparable prowess and unassailable skill, realized that he had been bested by the scion of the Raghu lineage, the lord of the three worlds. He acknowledged that it would not befit him to feel shame and conceded that Rama should release the arrow. Subdued, Parasurama spoke respectfully, explaining that having gifted the earth to Kasyapa, he had vowed not to dwell there. He would now withdraw to the Mahendra Mountain, leaving the worlds conquered by his asceticism to Rama.</p>  <p>Witnessing this, hosts of sages, devatas, gandharvas, apsaras, siddhas, charanas, kinnaras, yakshas, rakshsas, and nagas assembled to behold Rama wielding the bow of Vishnu. Parasurama departed to Mahendra Mountain, and the quarters of the world were cleared of darkness. The sages and gods praised Rama’s valor, and Parasurama, having circumambulated Rama in respect, returned to his abode.</p>  <p>Thus ends the seventy-sixth sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i>, recounting Rama’s mastery over the bow of Vishnu and the respectful departure of Parasurama to Mahendra Mountain.</p>",
        "**<u>The Seventy-Seventh Sarga of Bala Kanda: Dasaratha Enters Ayodhya with His Sons—Bharata and Satrughna Depart—Rama’s Virtues Described</u>** <p>After Parasurama departed, Rama, son of Dasaratha, with serene mind, returned the mighty bow and arrow to Varuna. Paying obeisance to Vasishta and the other rishis, he noticed his agitated father and spoke words of reassurance. He directed the four divisions of the army, commanded by him, to advance towards Ayodhya. The army, awaiting his orders like thirsty Chataka birds seeking water, moved forward under the king’s command.</p>  <p>On hearing that Parasurama had departed, King Dasaratha embraced Rama and kissed his forehead, feeling as if he and his son were reborn. The king directed the army to proceed, and as they entered Ayodhya, the city appeared magnificently decorated with flags, banners, sprinkled water, flowers, and resounded with trumpet sounds. Citizens and brahmins welcomed the king and his sons with delight, while Dasaratha entered his palace, grand as the Himalayas.</p>  <p>The royal family received the new brides—Sita, Urmila, Mandavi, and Srutakirti—who shone in silken attire and immediately worshipped the family deities. They entered their palaces, resembling Kubera’s abode, gave gifts to brahmins, and joined their husbands in joy. The princes, noble, wealthy, capable in arms, and accompanied by friends, dutifully served their father, moving about with valor and discipline.</p>  <p>After some time, King Dasaratha addressed Bharata, son of Kaikeyi, informing him that his maternal uncle, Yudhajit, had come to take him. Bharata, valiant and dutiful, paid obeisance to his father and Rama, embraced Lakshmana, and departed with Satrughna. Following their departure, mighty Rama and Lakshmana continued to serve their father, diligently attending to citizens and fulfilling duties towards their mothers and elders, pleasing all.</p>  <p>Dasaratha was delighted with Rama’s virtuous conduct, and the citizens, brahmins, and people of the kingdom rejoiced. Glorious Rama, possessing truthfulness, valor, and manifold virtues, became the protector of his people, like Brahma among living beings. Rama, devoted to Sita, enjoyed all seasons with her, his affection growing continually. Sita, daughter of Janaka of Mithila, embodiment of Lakshmi, was ever dear to him, and their hearts communicated every thought silently. United with the most charming princess, Rama shone like Vishnu, in joy and prosperity, blessed with beauty and grace.</p>  <p>Thus ends the seventy-seventh sarga of Bala Kanda of the holy <i>Rāmāyaṇa</i>, recounting the return of Rama and Dasaratha to Ayodhya, the departure of Bharata and Satrughna, and the virtuous life of Rama with Sita.</p>"
      ],
      "2": [
        "Ayodhya Kanda: Coming on 01-Nov-2025."
      ],
      "3": [
        "Aranya Kanda: Coming on 01-Jan-2026."
      ]
    }
  },

  "mahabharata": {
    "hindi": {
      "1": [
        "जल्द आ रहा है"
      ],
      "2": [
        "जल्द आ रहा है"
      ],
      "3": [
        "जल्द आ रहा है"
      ]
    },
    "marathi": {
      "1": [
        "लवकरच उपलब्ध होईल"
      ],
      "2": [
        "लवकरच उपलब्ध होईल"
      ],
      "3": [
        "लवकरच उपलब्ध होईल"
      ]
    },
    "english": {
      "1": [
        "Coming Soon."
      ],
      "2": [
        "Coming Soon."
      ],
      "3": [
        "Coming Soon."
      ]
    }
  },

  "puranas": {
    "hindi": {
      "1": [
        "विष्णु पुराण: जल्द आ रहा है"
      ],
      "2": [
        "शिव पुराण: जल्द आ रहा है"
      ],
      "3": [
        "देवी भागवत: जल्द आ रहा है"
      ]
    },
    "marathi": {
      "1": [
        "विष्णुपुराण: लवकरच उपलब्ध होईल"
      ],
      "2": [
        "शिवपुराण: लवकरच उपलब्ध होईल"
      ],
      "3": [
        "देवी भागवत: लवकरच उपलब्ध होईल."
      ]
    },
    "english": {
      "1": [
        "Vishnu Purana: Coming Soon.."
      ],
      "2": [
        "Shiva Purana: Coming Soon.."
      ],
      "3": [
        "Devi Bhagavat: Coming Soon.."
      ]
    }
  }
}
