{
  "ramayana": {
    "hindi": {
      "1": [
        "०१-नवंबर-२०२५ से उपलब्ध"
      ],
      "2": [
        "०१-जनवरी-२०२६ से उपलब्ध"
      ],
      "3": [
        "०१-जनवरी-२०२६ से उपलब्ध"
      ]
    },
    "marathi": {
      "1": [
        "०१-नोव्हेंबर-२०२५ पासून उपलब्ध"
      ],
      "2": [
        "०१-जानेवारी-२०२६ पासून उपलब्ध"
      ],
      "3": [
        "०१-जानेवारी-२०२६ पासून उपलब्ध"
      ]
    },
    "english": {
      "1": [
        "The First Sarga of Bala Kanda : <p>Once, Sage Valmiki asked Narada: 'Is there a man living today who is truly virtuous, brave, righteous, grateful, truthful, self-controlled, and compassionate? One who protects all beings, is wise, radiant, free from jealousy, and so powerful that even the gods fear his anger?' </p><p>Narada replied: 'Yes, such a man exists. He is Sri Rama, born in the Ikshvaku dynasty. Rama is strong, handsome, and skilled in archery. He knows the Vedas, honors elders, protects his people, and rules with justice and compassion. Beloved of all, he is the delight of his mother Kausalya and the ideal heir to King Dasaratha.' <p>Narada then briefly recounted Rama’s life: Rama was chosen heir, but by Kaikeyi’s demand, he went into exile for fourteen years with Sita and Lakshmana. In the forest, he killed rakshasas, but Ravana abducted Sita. \nWith the help of Hanuman and Sugriva’s vanara army, Rama crossed the ocean, slew Ravana, and rescued Sita. After her trial by fire proved her purity, Rama accepted her back.He returned to Ayodhya, was crowned king, and ruled righteously for eleven thousand years. </p><p>During his reign, people were happy, free from sorrow, disease, or fear. Cities prospered, righteousness flourished, and sacrifices were performed. At the end of his time, Rama returned to his divine abode.This story of Rama is sacred, destroys sin, and brings prosperity, longevity, and merit equal to the Vedas.</p><p>Thus ends the first sarga of Bala Kanda, the holy Ramayana composed by Sage Valmiki</p>",
        "The Second Sarga of Bala Kanda : <p>Sage Valmiki went to the river Tamasa for his morning ablutions. There, he saw a hunter kill a male krauncha bird while its mate wailed in grief. Moved by compassion, Valmiki spontaneously composed a four-line verse expressing the sorrow of the female bird. This was the first sloka, or metrical verse, in Sanskrit. His disciple Bharadwaja memorized it, and Valmiki returned to his hermitage, meditating and composing more verses. </p><p>At that moment, Lord Brahma appeared before Valmiki and blessed him. Brahma instructed him to compose the story of Rama in the same metre, exactly as Narada had narrated it. Brahma granted him the power of clairvoyance, so he could know all events, thoughts, and deeds, even those hidden from others. Brahma assured Valmiki that every word of this epic would be true, and as long as mountains and rivers exist, the Ramayana would be remembered. He also promised that Valmiki would be honored in all worlds. Valmiki, inspired by Brahma, began composing the Ramayana in beautifully metered slokas, each line clear, melodious, and meaningful.This epic glorifies Rama, his deeds, his virtues, and his battles, including the killing of Ravana. </p><p>Thus ends the second sarga of Balakanda, which tells how the Ramayana was divinely inspired and first composed by Sage Valmik.</p>",
        "The Third Sarga of Bala Kanda : <p>After hearing the full story of Rama from Narada, Sage Valmiki wished to understand it in greater detail. Using the power of his penance and meditation, he clearly visualized Rama, Lakshmana, Sita, King Dasaratha, their kingdom, and all events of their lives, including conversations, laughter, and emotions, as if he were seeing them in real life.</p><p> With this vision, Valmiki prepared to compose the Ramayana, blending the merits of righteousness, virtue, and worldly life. He narrated Rama’s life exactly as told by Narada, including: Rama’s birth, virtues, prowess, marriage to Sita, and breaking of the great bow.His association with Viswamitra, the conflict with Parasurama, preparations for coronation, and Kaikeyi’s wickedness. Rama’s departure to the forest, the grief of King Dasaratha and the people of Ayodhya, and his stay in Chitrakuta. Encounters with Guha, sages, Viradha, Kabandha, Sabari, and Hanuman. The friendship pact with Sugriva, the fight between Sugriva and Vali, and the consolidation of the monkey forces. The search for Sita, Hanuman’s journey to Lanka, meeting Sita, delivering Rama’s ring, fighting demons, and burning Lanka. The building of the bridge by Nala, the crossing of the ocean, the siege of Lanka, the deaths of Kumbhakarna, Meghanada, and Ravana, and the reunion with Sita. The coronation of Vibhishana, Rama’s return to Ayodhya, reunion with Bharata, the king’s coronation, and the temporary banishment of Sita. Valmiki, through his divine insight, also composed events yet to occur in the Uttarakanda. </p><p>Thus ends the third sarga of Balakanda, describing how Valmiki, inspired by Narada and Brahma, visualized and recorded the entire story of Rama.</p>",
		"The Fourth Sarga of Bala Kanda : <p>Sage Valmiki composed the entire Ramayana in 24,000 verses, including the six kandas and Uttarakanda, describing the life of Rama, Sita, Lakshmana, and the events leading to Ravana’s defeat.</p><p>After composing it, Valmiki wanted someone capable of reciting the epic beautifully. Kusa and Lava, the twin sons of Rama, came to him. Valmiki, recognizing their intellect, melodious voices, and auspicious presence, taught them the entire Ramayana.</p><p>The twins memorized the epic and began singing it at assemblies of sages, brahmins, and saints. Their singing was so melodious and vivid that the sages felt as if the events were happening right before them. The audience praised Kusa and Lava with joy, offering them gifts and garments.</p><p>Kusa and Lava also sang in public places, delighting everyone who heard them and bringing happiness, prosperity, and long life to their listeners.When Rama heard of their performance, he invited the brothers to his palace. Surrounded by his ministers and brothers, Rama listened as Kusa and Lava chanted the Ramayana with skill and devotion. He encouraged everyone to concentrate and enjoy the story, praising the twins for their royal qualities and ascetic discipline.The brothers sang in classical style, tuning their instruments and conveying the meaning of every verse. Their performance pleased everyone, including Rama himself.</p><p>Thus ends the fourth sarga of Balakanda, showing how the Ramayana was preserved, propagated, and glorified through Kusa and Lava.</p>",
		"The Fifth Sarga of Bala Kanda : <p>This section describes King Dasaratha’s kingdom and the greatness of Ayodhya.</p><p>Ayodhya, the capital of Kosala on the banks of river Sarayu, was a prosperous and magnificent city, built by Manu. It extended twelve yojanas in length and three in breadth, with broad, flower-strewn streets, well-arranged markets, palaces, gardens, and sal tree groves. The city was well-fortified with a deep moat and richly supplied with elephants, horses, cattle, camels, and mules. Tributes from surrounding kings and merchants from afar added to its grandeur.</p><p>The city was alive with music, dancing, and artisans, adorned with seven-storied palaces, gems, and ornaments, and resembled Indra’s Amaravati in splendor. The palaces were orderly, level, and inhabited by noble men.</p><p>Ayodhya was home to thousands of maharatha warriors, expert archers who could kill even wild lions, tigers, and boars in the forests but were just and restrained in battle. The city also housed excellent brahmins, kshatriyas, and vaisyas, learned in the Vedas, performing sacrificial rites, generous, truthful, and virtuous.</p><p>At the heart of this splendid city lived King Dasaratha, ruling with prosperity and righteousness.</p><p>Thus ends the fifth sarga of Balakanda, highlighting the grandeur of Ayodhya and the nobility of its people.</p>",
		"The Sixth Sarga of Bala Kanda : <p>This section describes the wealth, prosperity, and virtuous life of Ayodhya’s citizens under King Dasaratha.</p><p>King Dasaratha, an expert in Vedas, dharma, and governance, ruled the kingdom like Indra in Amaravati. He was mighty, just, self-controlled, and beloved by his subjects. His administration ensured peace, order, and abundance.</p><p>The people of Ayodhya were virtuous, wealthy, learned, truthful, charitable, and free from avarice or vice. Every householder had adequate resources, performed sacrifices, and followed dharma, artha, and kama. Brahmins were devout, knowledgeable, and generous; kshatriyas were obedient and valorous; vaisyas engaged in trade, and sudras assisted dutifully.</p><p>The city was filled with splendid horses, elephants, and chariots, indicating both wealth and military power. Citizens wore ornaments, fragrant oils, and garlands; no one was dishonest, ignorant, or impure. All men and women were self-controlled, devoted to the king, and lived in harmony with their families.</p><p>Ayodhya, spreading sixteen miles, was richly adorned with magnificent edifices, gates, and locks, and thronged with thousands of able men. Under Dasaratha’s wise and righteous rule, the city prospered like a model kingdom, invincible and glorious.</p><p>Thus ends the sixth sarga of Balakanda, highlighting the prosperity, virtue, and grandeur of Dasaratha’s rule.</p>",
		"The Seventh Sarga of Bala Kanda : <p>This section highlights King Dasaratha’s court, his ministers, and their virtues.</p><p>Dasaratha, the mighty Ikshvaku king, was assisted by eight exemplary ministers—Dhrishti, Jayanta, Vijaya, Siddhartha, Arthasadhaka, Ashoka, Mantrapala, and Sumantra—along with family priests Vasishta and Vamadeva. All were virtuous, learned, truthful, and skilled in governance. They could discern motives, administer justice impartially, manage the treasury, raise armies, and protect the kingdom.</p><p>The ministers were compassionate, forgiving, and disciplined, ensuring that no one was unjustly punished, while still maintaining law and order. They were experts in ethics, statecraft, and diplomacy, and always upheld the king’s welfare. Their decisions were unanimous, fair, and guided by intelligence and morality.</p><p>With such wise and capable ministers, King Dasaratha ruled justly, righteously, and powerfully. His administration brought peace, prosperity, and happiness to the kingdom, and his glory spread across the three worlds. Tributary kings obeyed him, his enemies were subdued, and his reign shone like the rising sun, reflecting his virtues and the loyalty of his ministers.</p><p>Thus ends the seventh sarga of Balakanda, emphasizing the harmony and excellence of Dasaratha’s rule and the integrity of his court..</p>",
		"The Eight Sarga of Bala Kanda : <p>King Dasaratha, despite his greatness, had no sons to continue the Ikshvaku lineage, which caused him deep sorrow as he aged. Resolving to obtain heirs, he decided to perform the Ashwamedha (horse) sacrifice to invoke divine blessings.</p><p>He summoned his ministers, sages, and family priests, including Vasishta, Suyajna, Vamadeva, Jabali, and Kasyapa, to seek their guidance and approval. Expressing his desire, Dasaratha emphasized that having no sons was a source of deep suffering, and asked for their advice on performing the sacrifice properly.</p><p>The brahmins and priests praised the king’s decision, assuring him that it was righteous and would indeed fulfill his desire for sons. They instructed that all necessary articles for the sacrifice be collected and the sacrificial horse be released under proper supervision. They also emphasized that the ritual must follow the sacred ordinances carefully, as any flaw could nullify the sacrifice.</p><p>Dasaratha then instructed his ministers to ensure that the sacrifice was conducted flawlessly according to the scriptures. After sending away the knowledgeable brahmins, he addressed his wives, urging them to begin their own religious disciplines in preparation for the sacred rites.</p><p>The announcement of the sacrifice brought joy to his wives, whose faces shone like blooming lotuses, signifying the auspiciousness of the event.</p><p>Thus ends the eighth sarga of Balakanda, highlighting Dasaratha’s devotion, adherence to dharma, and his efforts to secure heirs through the Ashwamedha sacrifice...</p>",
		"The Nineth Sarga of Bala Kanda : <p>King Dasaratha was privately advised by his minister Sumantra, who recalled an ancient prophecy by the sage Sanatkumara. The prophecy said that Dasaratha would gain sons through the help of sage R̥ṣyaśṛṅga, the son of Vibhaṇḍaka rishi.</p><p>R̥ṣyaśṛṅga had been raised in the forest by his father, knowing nothing of the outside world, and was devoted to a strict life of celibacy and worship.</p><p>Meanwhile, in the kingdom of Anga, ruled by King Romapada, a terrible drought struck because the king had failed in his duties. Seeking a solution, the learned brahmins of Anga told Romapada that only by bringing R̥ṣyaśṛṅga to his land could the drought be ended.</p><p>Fearing the power of Vibhaṇḍaka, the king’s men hesitated, but eventually, by clever means involving courtesans, they succeeded in bringing R̥ṣyaśṛṅga to Anga. As soon as he arrived, rains poured down, ending the famine.</p><p>In gratitude, Romapada gave his daughter Śāntā in marriage to the sage R̥ṣyaśṛṅga.</p><p>Sumantra concluded by telling Dasaratha that this very R̥ṣyaśṛṅga, now Romapada’s son-in-law, would be the one to perform the sacrifice that would grant Dasaratha sons.</p><p>Pleased by this account, Dasaratha asked Sumantra to explain in detail how exactly R̥ṣyaśṛṅga had been brought from his hermitage.</p><p>Thus ends the ninth sarga of Balakanda..</p>",
		"The Tenth Sarga of Bala Kanda : <p>At King Daśaratha’s request, Sumantra began to narrate how R̥ṣyaśṛṅga was brought to the kingdom of Anga.</p><p>The ministers of King Romapāda had devised a plan. They said:“R̥ṣyaśṛṅga, son of the sage Vibhaṇḍaka, lives in the forest, absorbed in penance and Vedic study. He has never seen a woman nor known worldly pleasures. If we send beautifully adorned courtesans, they can gently win his heart and bring him here.”</p><p>Romapāda agreed, and the plan was set in motion.</p><p>The courtesans entered the forest and waited near the hermitage. One day, the young ascetic R̥ṣyaśṛṅga, who had never seen any living being outside the forest, came upon them. The women sang sweetly, smiled, and asked him who he was.</p><p>Innocently, R̥ṣyaśṛṅga introduced himself:“I am the son of sage Vibhaṇḍaka. My name is R̥ṣyaśṛṅga. Please come to our hermitage; I will offer you fruits and roots.”</p><p>The women went with him, accepted his offerings, but quickly departed in fear of Vibhaṇḍaka’s return. Before leaving, they embraced him and gave him sweets and delicacies, which he mistook for forest fruits.</p><p>When they left, R̥ṣyaśṛṅga felt restless and sorrowful. The next day, drawn by longing, he went in search of them. The courtesans welcomed him again and said:“Handsome one, come to our hermitage. We will give you greater hospitality.”</p><p>Overjoyed, R̥ṣyaśṛṅga agreed. The women gently led him away — and as soon as he set foot in Anga, the heavens poured rain, ending the long famine.</p><p>King Romapāda himself came out to receive the sage. Bowing low, he worshipped him with great devotion and prayed that Vibhaṇḍaka would not be angered at this act.</p><p>Then, to honor him, Romapāda offered his daughter Śāntā in marriage to R̥ṣyaśṛṅga. The sage accepted, and thus he lived happily in Anga, bringing peace and prosperity to the kingdom.</p><p>Thus ends the tenth sarga of Balakanda of the holy Rāmāyaṇa, the first epic composed by sage Vālmīki..</p>",
		"The Eleventh  Sarga of Bala Kanda : <p>Hearing Sanatkumara’s prophecy, Sumantra advised King Dasaratha to approach King Romapada of Anga. Romapada’s daughter Shanta was married to the sage Rsyasringa, a holy brahmin of great spiritual power who alone could help Dasaratha gain sons.</p><p>Eager and hopeful, Dasaratha set out with his queens and ministers to meet Romapada. Crossing forests and rivers, he finally reached the kingdom of Anga, where Romapada warmly welcomed him with friendship and honor. There, Dasaratha also met the gentle Shanta and her radiant husband, Rsyasringa.</p><p>After days of hospitality, Dasaratha spoke of his deep desire for children and respectfully requested that Rsyasringa accompany him to Ayodhya to perform a great sacrifice. Romapada gladly agreed, and with his blessing, Rsyasringa and Shanta prepared to leave.</p><p>As they journeyed back, messengers hurried ahead, announcing the king’s return. The citizens of Ayodhya joyfully decorated the city with flags, flowers, and water-sprinkled streets. Amidst the sound of drums and conches, Dasaratha entered the city, Rsyasringa and Shanta by his side.</p><p>The people rejoiced to see the holy sage, honored by the king like Indra himself. Dasaratha, filled with relief and happiness, welcomed Rsyasringa into the palace, knowing his wish was close to fulfillment. Shanta too was lovingly received by the royal women, who delighted in her presence.</p><p>Thus ended the eleventh sarga of Bala Kanda, where destiny began to unfold for the birth of Rama and his brothers.</p>",
		"The twelfth Sarga of Bala Kanda : <p>Spring arrived and in the freshness of the season King Dasaratha felt once more the deep longing for a son. The idea of performing the great horse sacrifice (Ashwamedha Yajña) stirred in his heart.</p> <p>He resolved that a priest worthy and shining like a celestial should be appointed to preside over the sacrifice so that his dynasty would continue unbroken. The king told his minister Sumantra to gather all sacred materials and to release the sacrificial horse — the sign that the rite was to begin.</p> <p>Sumantra at once summoned the wisest brahmins: Suyajna, Vamadeva, Jabali, Kashyapa, Vasiṣṭha, and others well versed in the Vedas. The king greeted them with respect, bowed to them, and spoke with words full of duty and righteousness.</p> <p>With folded hands, he confessed his sorrow: having no son, there was no true happiness for him. Yet he would follow scriptural rites, and through the grace of the sage R̥ṣyaśṛṅga, his desires would be fulfilled.</p> <p>The brahmins, led by Vasiṣṭha, heard him, blessed his intention, and spoke with certainty that he would indeed have four heroic sons. The king, overjoyed, gave orders that all needed materials be brought together, that the horse be released under protection, and that a sacrificial pavilion (yajña-bhūmi) be built on the northern bank of the river Sarayu.</p> <p>He commanded everything be done in perfect accord with the sacred texts, without flaw. He warned against any error, since celestial beings (brahma-rākṣasas) are ever watchful and will destroy any sacrifice marred by mistake.</p> <p>The ministers, faithful and capable, carried out his orders. The brahmins were honored and then permitted to return. King Dasaratha dismissed his ministers and entered his palace, satisfied that the first steps toward his desire had been sanctified.</p> <p>Thus ended the twelfth sarga of Bala Kāṇḍa of the holy Rāmāyaṇa, composed by Sage Valmiki.</p>",
		"The Thirteenth Sarga of Bala Kanda : <p>When spring came again and a full year had passed, King Dasaratha, filled with hope for sons, entered the sacrificial arena to begin worshipping the gods. He sought to perform the horse sacrifice (Ashwamedha) properly and without any obstruction.</p> <p>With respect and humility, the king greeted Sage Vasiṣṭha, his honored spiritual guide, and asked him to ensure that the sacrifice is carried out in perfect accordance with tradition and free from any flaw. He asked Vasiṣṭha to bear the burden of overseeing the ritual.</p> <p>Vasiṣṭha, kind and devoted, promised to fulfill every requirement. He summoned experienced brahmins, skilled artisans, workers, dancers, actors, carpenters, architects, and all those needed to prepare for the grand sacrifice. He ordered that residences, food, and hospitality be prepared for guests from all lands, including people of all castes.</p> <p>All the arrangements were made: food and drinks, richly decorated dwellings, and honorable treatment for guests, both from nearby regions and far-off countries. Care was taken that nothing small or insignificant was overlooked, and everything was managed with love and affection.</p> <p>Kings from many places heard of the king’s sacrifice and came bearing gifts. Vasiṣṭha, pleased with the preparations, told King Dasaratha that everyone was prepared, and that the auspicious moment had arrived. On a day blessed by favorable stars, Dasaratha, along with Rsyasringa and the foremost brahmins, entered the sacred sacrificial enclosure. The sacrifice began, following the scriptures in every detail.</p> <p>Thus ended the thirteenth sarga of Bala Kanda, where preparations for the Ashwamedha sacrifice were completed with perfection, setting the stage for the divine birth of Rama.</p>",
		"The fourteenth Sarga of Bala Kanda : <p>After a full year, the sacrificial horse returned, and King Daśaratha held the grand **Aśvamedha yajña** on the northern bank of the river Sarayu. The rituals began under the guidance of the great sage R̥ṣyaśṛṅga, the foremost of brahmins, who performed the rites with deep devotion and adherence to the sacred scriptures.</p> <p>The learned priests, masters of Vedas, carried out every ceremony—morning ablutions, offerings, pressing of soma, daily prayers—exactly as the scriptures prescribed. There were no mistakes, no defect, no delay; all the rituals proceeded seamlessly.</p> <p>People from many lands—brahmins, ascetics, the aged, the sick, women, and children—were well provided for. Food, garments, shelter, generosity—all were abundant. Devotees and guests, arriving from far and wide, were honored and served with joy.</p> <p>Sacrificial posts were erected with care, beautiful decorations placed, fires built with precision, and deities worshipped. The sacrificial altar was shaped like Garuda, posts wrapped in fine cloth and adorned with flowers and sandal paste. The implements and instruments were set with artistry, and everything shone in its glory.</p> <p>King Daśaratha gave charity generously—cows, gold, silver, food—to brahmins and needy alike. He honored them, bowed to them, and listened to their blessings. The great sacrifice removed his sins, earned him heaven’s favor, and would ensure many sons to carry on his royal line.</p> <p>Thus ended the fourteenth sarga of Bala Kanda, where Daśaratha’s sacrifice was fulfilled with perfection, blessing him with promise of four sons to uphold his lineage.</p>",
		"The fifteenth Sarga of Bala Kanda : <p>In the celestial assembly, the gods voiced concern to Brahmā over the terrible deeds of **Rāvana**, empowered by boons and frightening both gods and mortals. They spoke of how righteous beings suffer under his tyranny, and asked Brahmā to find a plan to curb his cruelty.</p> <p>Brahmā listened to the pleas of devas, gandharvas, sages and acknowledged that while Ravana’s boons must be respected, his evil conduct could no longer go unchecked. The gods expressed the need for a divine strategy to defeat Ravana.</p> <p>Moved by their distress, Brahmā then revealed that **Viṣṇu** would incarnate on earth as a human king—one who would take up arms to protect righteousness, destroy Ravana, and relieve the cosmos of fear and injustice. The gods rejoiced at this promise of deliverance.</p> <p>They then turned their minds towards **King Daśaratha**, the human ruler who would be part of this incarnation-plan. It was declared that the sacrifice and the birth of sons in Daśaratha’s lineage would be a link in the divine scheme to bring Viṣṇu’s avatar into the world.</p> <p>Thus ended the fifteenth sarga of Bala Kanda, where the gods’ plea for justice leads Brahmā to reveal the divine plan of Viṣṇu’s incarnation and Daśaratha’s role in cosmic destiny.</p>",
		"The sixteenth Sarga of Bala Kanda : <p>The gods, alarmed at the growing power and tyranny of Ravana, came together to seek a plan to restore justice. They appealed to Lord Vishnu, asking that he take human birth to defeat Ravana and lift the suffering of the worlds. Vishnu agreed, knowing all things yet speaking gently to the assembly.</p> <p>Meanwhile, King Daśaratha, who had no sons, was performing the sacred ritual called **Putrakāmeṣṭi** hoping to beget children. At the gods’ bidding, a divine being—Yajña Purusha—emerged from the sacrificial fire, holding a golden vessel filled with divine sweet dessert, meant to bestow progeny upon the king’s queens.</p> <p>King Daśaratha, overjoyed, distributed the divine dessert among his queens—Kausalyā, Sumitrā, and Kaikeyī—according to divine ordinance. Each queen received a portion, enabling them to conceive. Thus the promise that Daśaratha’s lineage would continue was fulfilled through God’s blessing.</p> <p>The Sacrifice was perfect, the gods were pleased, and hope was born in Ayodhya. The divine intervention ensured that the future heroes—Rama, Lakshmana, Bharata, and Shatrughna—would come into being.</p> <p>Thus ended the sixteenth sarga of Bala Kanda, where the gods’ plan and Daśaratha’s sacrifice combined to bring the divine promise of sons—destiny set in motion for the birth of Rama and his brothers.</p>",
		"The seventeenth Sarga of Bala Kanda : <p>As Dasaratha’s sonhood was secured and hope was reborn in Ayodhya, Brahma summoned all the gods. He asked them to create a race of Vanaras—like monkeys—with special powers so they could assist Rama in his future battle against Ravana. These Vanaras would be swift, strong, endowed with intellect, brave, and capable of aiding the righteous.</p> <p>So powerful beings—progeny from celestial beings like Apsaras, Gandharvas, and those of other divine lineages—were born. They were to serve as Rama’s allies, protectors of dharma, ever ready to fight against evil, fearless and loyal.</p> <p>Thus the gods laid down the foundation for the mighty Vanara race whose deeds would shine in Rama’s future struggles.</p> <p>Thus ended the seventeenth sarga of Bala Kanda, where the promise of vanara allies was born to uphold righteousness in Rama’s journey.</p>",
		"The eighteenth Sarga of Bala Kanda : <p>After the long wait following the Putrakāmeṣṭi sacrifice, twelve auspicious months had passed. At the dawn of Chaitra on the ninth day — under the Punarvasu asterism, when all the planets were favorably placed — Queen Kausalyā gave birth to Rama. His appearance was divine, adorned with all virtuous signs, and celebrated by all. </p> <p>The next day, Bharata was born under the Pushyami star, followed by the twins Lakshmana and Shatrughna — born to Queen Sumitrā — each with their own special qualities, yet together forming a perfect brotherhood. </p> <p>Dasaratha, filled with joy and gratitude, saw in their growth the fulfillment of his heartfelt hopes. The city celebrated; the sages praised; and the people rejoiced at the arrival of heirs who were seen as worthy of the Ikshvaku lineage. </p> <p>Thus ended the eighteenth sarga of Bala Kanda, where Rama, Bharata, Lakshmana, and Shatrughna were born under auspicious skies, fulfilling the promise of lineage and divine blessing.</p>"
      ],
      "2": [
        "Ayodhya Kanda: Coming on 01-Nov-2025."
      ],
      "3": [
        "Aranya Kanda: Coming on 01-Jan-2026."
      ]
    }
  },

  "mahabharata": {
    "hindi": {
      "1": [
        "जल्द आ रहा है"
      ],
      "2": [
        "जल्द आ रहा है"
      ],
      "3": [
        "जल्द आ रहा है"
      ]
    },
    "marathi": {
      "1": [
        "लवकरच उपलब्ध होईल"
      ],
      "2": [
        "लवकरच उपलब्ध होईल"
      ],
      "3": [
        "लवकरच उपलब्ध होईल"
      ]
    },
    "english": {
      "1": [
        "Coming Soon."
      ],
      "2": [
        "Coming Soon."
      ],
      "3": [
        "Coming Soon."
      ]
    }
  },

  "puranas": {
    "hindi": {
      "1": [
        "विष्णु पुराण: जल्द आ रहा है"
      ],
      "2": [
        "शिव पुराण: जल्द आ रहा है"
      ],
      "3": [
        "देवी भागवत: जल्द आ रहा है"
      ]
    },
    "marathi": {
      "1": [
        "विष्णुपुराण: लवकरच उपलब्ध होईल"
      ],
      "2": [
        "शिवपुराण: लवकरच उपलब्ध होईल"
      ],
      "3": [
        "देवी भागवत: लवकरच उपलब्ध होईल."
      ]
    },
    "english": {
      "1": [
        "Vishnu Purana: Coming Soon.."
      ],
      "2": [
        "Shiva Purana: Coming Soon.."
      ],
      "3": [
        "Devi Bhagavat: Coming Soon.."
      ]
    }
  }
}
