{
  "ramayana": {
    "hindi": {
      "1": [
        "रामायण का पहला भाग - बालकांड: इस खंड में राम के जन्म का वर्णन है।",
        "बालकांड में राम के शिक्षा और युवावस्था का वर्णन है।",
        "सीता स्वयंवर और विवाह का विवरण इस पृष्ठ में है।"
      ],
      "2": [
        "अयोध्याकांड: राम का वनवास प्रारंभ होता है।",
        "भरत का त्याग और राम के प्रति प्रेम का विवरण।"
      ],
      "3": [
        "अरण्यकांड: रावण द्वारा सीता हरण का वर्णन।",
        "राम और लक्ष्मण का वन में जीवन।"
      ]
    },
    "marathi": {
      "1": [
        "रामायणाचा पहिला भाग - बालकांड: रामाचा जन्म वर्णन.",
        "रामाचे शिक्षण आणि युवावस्था.",
        "सीता स्वयंवर आणि विवाहाचा तपशील."
      ],
      "2": [
        "अयोध्याकांड: रामाचे वनवास प्रारंभ.",
        "भरताचा त्याग आणि रामावरील प्रेम."
      ],
      "3": [
        "अरण्यकांड: रावणाने सीतेचे अपहरण.",
        "राम आणि लक्ष्मण यांचे वनातील जीवन."
      ]
    },
    "english": {
      "1": [
        "The First Sarga of Bala Kanda : <p>Once, Sage Valmiki asked Narada: 'Is there a man living today who is truly virtuous, brave, righteous, grateful, truthful, self-controlled, and compassionate? One who protects all beings, is wise, radiant, free from jealousy, and so powerful that even the gods fear his anger?' </p><p>Narada replied: 'Yes, such a man exists. He is Sri Rama, born in the Ikshvaku dynasty. Rama is strong, handsome, and skilled in archery. He knows the Vedas, honors elders, protects his people, and rules with justice and compassion. Beloved of all, he is the delight of his mother Kausalya and the ideal heir to King Dasaratha.' <p>Narada then briefly recounted Rama’s life: Rama was chosen heir, but by Kaikeyi’s demand, he went into exile for fourteen years with Sita and Lakshmana. In the forest, he killed rakshasas, but Ravana abducted Sita. \nWith the help of Hanuman and Sugriva’s vanara army, Rama crossed the ocean, slew Ravana, and rescued Sita. After her trial by fire proved her purity, Rama accepted her back.He returned to Ayodhya, was crowned king, and ruled righteously for eleven thousand years. </p><p>During his reign, people were happy, free from sorrow, disease, or fear. Cities prospered, righteousness flourished, and sacrifices were performed. At the end of his time, Rama returned to his divine abode.This story of Rama is sacred, destroys sin, and brings prosperity, longevity, and merit equal to the Vedas.</p><p>Thus ends the first sarga of Bala Kanda, the holy Ramayana composed by Sage Valmiki",
        "The Second Sarga of Bala Kanda : <p>Sage Valmiki went to the river Tamasa for his morning ablutions. There, he saw a hunter kill a male krauncha bird while its mate wailed in grief. Moved by compassion, Valmiki spontaneously composed a four-line verse expressing the sorrow of the female bird. This was the first sloka, or metrical verse, in Sanskrit. His disciple Bharadwaja memorized it, and Valmiki returned to his hermitage, meditating and composing more verses. </p><p>At that moment, Lord Brahma appeared before Valmiki and blessed him. Brahma instructed him to compose the story of Rama in the same metre, exactly as Narada had narrated it. Brahma granted him the power of clairvoyance, so he could know all events, thoughts, and deeds, even those hidden from others. Brahma assured Valmiki that every word of this epic would be true, and as long as mountains and rivers exist, the Ramayana would be remembered. He also promised that Valmiki would be honored in all worlds. Valmiki, inspired by Brahma, began composing the Ramayana in beautifully metered slokas, each line clear, melodious, and meaningful.This epic glorifies Rama, his deeds, his virtues, and his battles, including the killing of Ravana. </p><p>Thus ends the second sarga of Balakanda, which tells how the Ramayana was divinely inspired and first composed by Sage Valmik.",
        "The Third Sarga of Bala Kanda : <p>After hearing the full story of Rama from Narada, Sage Valmiki wished to understand it in greater detail. Using the power of his penance and meditation, he clearly visualized Rama, Lakshmana, Sita, King Dasaratha, their kingdom, and all events of their lives, including conversations, laughter, and emotions, as if he were seeing them in real life.</p><p> With this vision, Valmiki prepared to compose the Ramayana, blending the merits of righteousness, virtue, and worldly life. He narrated Rama’s life exactly as told by Narada, including: Rama’s birth, virtues, prowess, marriage to Sita, and breaking of the great bow.His association with Viswamitra, the conflict with Parasurama, preparations for coronation, and Kaikeyi’s wickedness. Rama’s departure to the forest, the grief of King Dasaratha and the people of Ayodhya, and his stay in Chitrakuta. Encounters with Guha, sages, Viradha, Kabandha, Sabari, and Hanuman. The friendship pact with Sugriva, the fight between Sugriva and Vali, and the consolidation of the monkey forces. The search for Sita, Hanuman’s journey to Lanka, meeting Sita, delivering Rama’s ring, fighting demons, and burning Lanka. The building of the bridge by Nala, the crossing of the ocean, the siege of Lanka, the deaths of Kumbhakarna, Meghanada, and Ravana, and the reunion with Sita. The coronation of Vibhishana, Rama’s return to Ayodhya, reunion with Bharata, the king’s coronation, and the temporary banishment of Sita. Valmiki, through his divine insight, also composed events yet to occur in the Uttarakanda. </p><p>Thus ends the third sarga of Balakanda, describing how Valmiki, inspired by Narada and Brahma, visualized and recorded the entire story of Rama.",
		"The Fourth Sarga of Bala Kanda : <p>Sage Valmiki composed the entire Ramayana in 24,000 verses, including the six kandas and Uttarakanda, describing the life of Rama, Sita, Lakshmana, and the events leading to Ravana’s defeat.</p><p>After composing it, Valmiki wanted someone capable of reciting the epic beautifully. Kusa and Lava, the twin sons of Rama, came to him. Valmiki, recognizing their intellect, melodious voices, and auspicious presence, taught them the entire Ramayana.</p><p>The twins memorized the epic and began singing it at assemblies of sages, brahmins, and saints. Their singing was so melodious and vivid that the sages felt as if the events were happening right before them. The audience praised Kusa and Lava with joy, offering them gifts and garments.</p><p>Kusa and Lava also sang in public places, delighting everyone who heard them and bringing happiness, prosperity, and long life to their listeners.When Rama heard of their performance, he invited the brothers to his palace. Surrounded by his ministers and brothers, Rama listened as Kusa and Lava chanted the Ramayana with skill and devotion. He encouraged everyone to concentrate and enjoy the story, praising the twins for their royal qualities and ascetic discipline.The brothers sang in classical style, tuning their instruments and conveying the meaning of every verse. Their performance pleased everyone, including Rama himself.</p><p>Thus ends the fourth sarga of Balakanda, showing how the Ramayana was preserved, propagated, and glorified through Kusa and Lava."
      ],
      "2": [
        "Ayodhya Kanda: Focuses on Rama’s exile.",
        "Bharata’s sacrifice and devotion to Rama."
      ],
      "3": [
        "Aranya Kanda: Narrates Ravana’s abduction of Sita.",
        "Rama and Lakshmana’s life in the forest."
      ]
    }
  },

  "mahabharata": {
    "hindi": {
      "1": [
        "आदिपर्व: इसमें पांडवों और कौरवों का परिचय है।",
        "राजकुमारों के बचपन और शिक्षा का वर्णन।"
      ],
      "2": [
        "सभापर्व: कौरव और पांडवों के बीच खेल और सभा।",
        "धर्म और राजनीति के संघर्ष का विवरण।"
      ],
      "3": [
        "वनपर्व: पांडवों का वनवास।",
        "विविध युद्ध और शिक्षा का वर्णन।"
      ]
    },
    "marathi": {
      "1": [
        "आदिपर्व: पांडव आणि कौरवांचा परिचय.",
        "राजकुमारांचे बालपण आणि शिक्षण."
      ],
      "2": [
        "सभापर्व: सभा आणि राजकारण.",
        "धर्म आणि संघर्षाची माहिती."
      ],
      "3": [
        "वनपर्व: पांडवांचे वनवास.",
        "युद्ध आणि शिकवणी."
      ]
    },
    "english": {
      "1": [
        "Adiparva: Introduction to Pandavas and Kauravas.",
        "Childhood and education of princes."
      ],
      "2": [
        "Sabha Parva: Games and court events.",
        "Conflicts of dharma and politics."
      ],
      "3": [
        "Vanaparva: Pandavas’ exile.",
        "Various battles and lessons."
      ]
    }
  },

  "puranas": {
    "hindi": {
      "1": [
        "विष्णु पुराण: भगवान विष्णु के लीलाओं का वर्णन।",
        "सृष्टि, प्रलय और अवतार विवरण।"
      ],
      "2": [
        "शिव पुराण: भगवान शिव के चरित्र और तपस्या।",
        "शिव के विभिन्न रूप और कथाएँ।"
      ],
      "3": [
        "देवी भागवत: देवी शक्ति और भक्ति की कहानियाँ।",
        "अनेक देवी कथाओं का विवरण।"
      ]
    },
    "marathi": {
      "1": [
        "विष्णुपुराण: विष्णूच्या लीला.",
        "सृष्टी, प्रलय आणि अवतार."
      ],
      "2": [
        "शिवपुराण: शिवांचे चरित्र आणि तपस्या.",
        "शिवाचे विविध रूप आणि कथा."
      ],
      "3": [
        "देवी भागवत: देवी शक्ती आणि भक्ती कथा.",
        "अनेक देवी कथांचा तपशील."
      ]
    },
    "english": {
      "1": [
        "Vishnu Purana: Stories of Lord Vishnu’s incarnations.",
        "Creation, destruction, and avatars."
      ],
      "2": [
        "Shiva Purana: Life and penance of Lord Shiva.",
        "Different forms and legends of Shiva."
      ],
      "3": [
        "Devi Bhagavat: Stories of Goddess Shakti and devotion.",
        "Various legends of goddesses."
      ]
    }
  }
}
